testhound/alo/alo/octave/m480/M480GenRtlVisitor.cpp
#include <sstream>
using namespace std;
#include <M480Instructions.h>
using namespace Llir;

#include "M480GenRtlVisitor.h"
#include "M480RtlPrintVisitor.h"
extern "C" {
#include <llir-gcc-connection.h>
#include <insn-constants.h>
}

namespace Alo
{

  M480GenRtlVisitor::M480GenRtlVisitor(OctaveAlo &i)
    : OctaveGenerateRtlVisitor(i),
      m_lastEssState(ESS_CC_MODE),
      m_essRegName("r66")
  {}

  M480GenRtlVisitor::M480GenRtlVisitor(const M480GenRtlVisitor& rhs)
    : OctaveGenerateRtlVisitor(rhs),
      m_lastEssState(rhs.m_lastEssState),
      m_essRegName(rhs.m_essRegName)
  {}

  const M480GenRtlVisitor&
  M480GenRtlVisitor::operator=(const M480GenRtlVisitor& rhs)
  {
    if(this == &rhs)
      {
	return *this;
      }

    OctaveGenerateRtlVisitor::operator=(rhs);
    m_lastEssState = rhs.m_lastEssState;
    m_essRegName = rhs.m_essRegName;

    return *this;
  }

  void 
  M480GenRtlVisitor::visit(const M480AddInstruction &i)
  {
    if(inFunction())
      {
	//found this insn within a .evh/.entry

	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    //generate RTL for the insn

	    genOperandRtl(i);

	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());
	

	    //if all the registers set in this insn are subsequently unused
	    //and this insn has no implicit writes to memory, generate
	    //a warning to the user specifying that this insn might be
	    //deleted during optimization
	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }
	    
	    if(!i.getModFlag()->isNullOperand())
	      {

		//helps in determining whether to generate
		//add insn with a clobber of ESS or set of ESS bits
		//during RTL generation
		bool isEssLive = i.isRegisterLive(REG_ESS);

		//store the affect on flags.
		m_lastEssState = ESS_CCUNS_MODE; 

		gcc_emit_add_modx_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	      }
	    else
	      {
		bool isEssLive = i.isRegisterLive(REG_ESS);
		m_lastEssState = ESS_CC_MODE;
		gcc_emit_add_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	      }

	  }
	else
	  {
	    // **** FIXME : this feature needs to be completed **** //

	    //found this insn in .noopt and .endnopt section of code
	    //emit this insn as an 'asm' to restrict its free movement
	    //in the RTL stream during optimization.
	    //the plan is to still be able to do register allocation.
	    genAsmRtlForInstruction(i);
	  }
      }
    else
      {
	//this is a dangling insn outside a .evh/.entry
	//no need to generate real RTL, no optimization will be
	//done on this insn. just emit it as text in the RTL stream
	//to printed as is to the .s2 file
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480Add4xInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();
	
	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	    
	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }
	    
	    if(!i.getModFlag()->isNullOperand())
	      {
		bool isEssLive = i.isRegisterLive(REG_ESS);
		m_lastEssState = ESS_CCUNS_MODE;
		gcc_emit_add4x_modx_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	      }
	    else
	      {
		bool isEssLive = i.isRegisterLive(REG_ESS);
		m_lastEssState = ESS_CC_MODE;
		gcc_emit_add4x_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	      }
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480AddcInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();
	
	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	    
	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }
	    
	    if(!i.getModFlag()->isNullOperand())
	      {
		bool isEssLive = i.isRegisterLive(REG_ESS);
		m_lastEssState = ESS_CCUNS_MODE;
		gcc_emit_addc_modx_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	      }
	    else
	      {
		bool isEssLive = i.isRegisterLive(REG_ESS);
		m_lastEssState = ESS_CC_MODE;
		gcc_emit_addc_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	      }
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480AddciInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();
	
	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	    
	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    if(!i.getModFlag()->isNullOperand())
	      {
		bool isEssLive = i.isRegisterLive(REG_ESS);
		m_lastEssState = ESS_CCUNS_MODE;
		gcc_emit_addci_modx_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	      }
	    else
	      {
		bool isEssLive = i.isRegisterLive(REG_ESS);
		m_lastEssState = ESS_CC_MODE;
		gcc_emit_addci_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	      }
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480AddiInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();
	
	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	    
	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());
	    
	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

