testhound/alo/alo/octave/m480/M480GenRtlVisitor.cpp
	if(i.getBranchTarget()->isNullOperand())
	  {
	    insnRaiseException("Branch target not specified",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }
	
	if (i.inInstructionSequence())
	  {
	    insnRaiseException("Cannot place branch insns in the noreorder region",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }
	
	
	genOperandRtl(i);
	
	//store the affect on flags...
	bool isEssLive = i.isRegisterLive(REG_ESS);
	m_lastEssState = ESS_CC_CY_MODE;
	
	LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

	OctaveInstruction::BranchProbability pr = i.getBranchProbability();

	gcc_emit_addwli_br_insn(line, file, isEssLive, lnk, mem, pr, i.inInstructionSequence());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480AddwwInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();
	
	if(!i.getBranchTarget()->isNullOperand())
	  {
	    insnRaiseException("Cannot generate code for Addww instruction with branch, Use pseudo Op Jaddww",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }
	
	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	    
	    bool isEssLive = i.isRegisterLive(REG_ESS);
	    m_lastEssState = ESS_CC_CY_MODE;
	    
	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }
	    
	    gcc_emit_addww_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }
    
  void 
  M480GenRtlVisitor::visit(const M480JaddwwInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();
	
	if(i.getBranchTarget()->isNullOperand())
	  {
	    insnRaiseException("Branch target not specified",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }
	
	if (i.inInstructionSequence())
	  {
	    insnRaiseException("Cannot place branch insns in the noreorder region",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }
	
	genOperandRtl(i);
	
	bool isEssLive = i.isRegisterLive(REG_ESS);
	m_lastEssState = ESS_CC_CY_MODE;
	
	LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());
        
	OctaveInstruction::BranchProbability pr = i.getBranchProbability();
	
	gcc_emit_addww_br_insn(line, file, isEssLive, lnk, mem, pr, i.inInstructionSequence());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }
    

  void 
  M480GenRtlVisitor::visit(const M480AddwwiInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if(!i.getBranchTarget()->isNullOperand())
	  {
	    insnRaiseException("Cannot generate code for Addwwi instruction, Use pseudo Op Jaddwwi",
			       i.getSrcLineNum(), i.getSrcFile());
	  }

	if (!i.inInstructionSequence())
	  { 
	    genOperandRtl(i);
	
	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }
	
	    // Addli sets all 5 condition code bits
	    bool isEssLive = i.isRegisterLive(REG_ESS);
	    m_lastEssState = ESS_CC_CY_MODE;
	
	    gcc_emit_addwwi_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480JaddwwiInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if(i.getBranchTarget()->isNullOperand())
	  {
	    insnRaiseException("Branch target not specified",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

	if (i.inInstructionSequence())
	  {
	    insnRaiseException("Cannot place branch insns in the noreorder region",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }
   
	genOperandRtl(i);

	bool isEssLive = i.isRegisterLive(REG_ESS);
	m_lastEssState = ESS_CC_CY_MODE;
    
	LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

	OctaveInstruction::BranchProbability pr = i.getBranchProbability();

	gcc_emit_addwwi_br_insn(line, file, isEssLive, lnk, mem, pr, i.inInstructionSequence());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }


  void 
  M480GenRtlVisitor::visit(const M480AndInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    bool isEssLive = i.isRegisterLive(REG_ESS);
	    m_lastEssState = ESS_CCUNS_MODE;

	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    if(!i.getModFlag()->isNullOperand())
	      gcc_emit_and_modx_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	    else
	      gcc_emit_and_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480AndiInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

