testhound/alo/alo/octave/m480/M480GenRtlVisitor.cpp
	    bool isEssLive = i.isRegisterLive(REG_ESS);
	    m_lastEssState = ESS_CCUNS_MODE;

	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    gcc_emit_andi_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void
  M480GenRtlVisitor::visit(const M480BciInstruction &i)
  {
    if(inFunction())
      {
	insnRaiseException("Cannot generate code for Bci instruction, Use pseudo Op Jbci",
			   i.getSrcLineNum(), i.getSrcFile());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void
  M480GenRtlVisitor::visit(const M480BcrInstruction &i)
  {
    if(inFunction())
      {
	insnRaiseException("Cannot generate code for Bcr instruction, Use pseudo Op Jbcr",
			   i.getSrcLineNum(), i.getSrcFile());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void
  M480GenRtlVisitor::visit(const M480BcdiInstruction &i)
  {
    if(inFunction())
      {
	insnRaiseException("Cannot generate code for Bcdi instruction, Use pseudo Op Jbcdi",
			   i.getSrcLineNum(), i.getSrcFile());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void
  M480GenRtlVisitor::visit(const M480BcdrInstruction &i)
  {
    if(inFunction())
      {
	insnRaiseException("Cannot generate code for Bcdr instruction, Use pseudo Op Jbcdr",
			   i.getSrcLineNum(), i.getSrcFile());
      }

    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void
  M480GenRtlVisitor::visit(const M480JbcdiInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	genOperandRtl(i);

	checkCFlag(getAlo(), i.getFlags(), i.getSrcLineNum(), i.getSrcFile());

	unsigned int ess = i.getEss()->getFlagNum();
	bool bf_flag = checkBFFlag(i.getFlags());

	OctaveInstruction::BranchProbability pr = i.getBranchProbability();

	if(!i.getDst()->isNullOperand())
	  {
	    unsigned int call_use_regs[64];
	    unsigned int call_return_regs[64];

	    for(unsigned int reg=0; reg <= 63; reg++)
	      {
		call_use_regs[reg]=0;		
		call_return_regs[reg]=0;
	      }

	    FindBranchLabelVisitor v;
	    i.getSrc1()->accept(v);

	    string labelName = v.getBranchTarget();

	    shared_ptr<const PrototypeDirective> proto = 
	      searchForPrototype(i.getSrcLineNum(),
				 i.getSrcFile().c_str(),
				 labelName.c_str());

	    computeCallUseRegSet(proto, call_use_regs);
	    computeCallReturnRegSet(proto, call_return_regs);

	    unsigned int argNum = computeNumOfArgRegs(proto) * 4; //in bytes.

	    gcc_emit_cond_call_immediate(line,
					 file,
					 ess, 
					 bf_flag, 
					 m_lastEssState, 
					 argNum, 
					 call_use_regs, 
					 call_return_regs, 
					 pr, 
					 i.inInstructionSequence());
	  }
	else
	  {
	    gcc_emit_cbr_immediate(line, 
				   file, 
				   ess, 
				   bf_flag, 
				   m_lastEssState, 
				   pr, 
				   i.inInstructionSequence());				   
	  }

      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void
  M480GenRtlVisitor::visit(const M480JbcdrInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	//bcdr rsb ESS rpc <- call insn
	//bcdr rpc ESS     <- return insn
	//bcdr rsb ESS     <- jump insn

	i.getSrc1()->accept(*this); // rsb

	if (!i.getDst()->isNullOperand())
	  i.getDst()->accept(*this);  // rpc

	checkCFlag(getAlo(), i.getFlags(), i.getSrcLineNum(), i.getSrcFile());

	shared_ptr<const EssFlag> essFlag = i.getEss();
      
	bool bf_flag = checkBFFlag(i.getFlags());
	unsigned int rsb = i.getSrc1()->getRegNum();
	unsigned int ess = essFlag->getFlagNum();
	bool isNegated = essFlag->isNegated();

	OctaveInstruction::BranchProbability pr = i.getBranchProbability();

	if (rsb == 60 ||
	    rsb == 61 ||
	    rsb == 62)
	  {
	    // conditional return insn

	    // Make all return insns to branch to a common exit point;
	    const char* exitLabel = getCurrentFunction()->getExitLabel().c_str();
	    gcc_push_label(exitLabel);

	    storeReturnReg(i.getSrc1(), line, file);

	    gcc_emit_cond_return_indirect(line,
					  file,
					  ess,
					  m_lastEssState,
					  pr,
					  i.inInstructionSequence());
	  }
	else if (i.getDst()->isNullOperand()) 
	  {
	    // conditional indirect branch insn.

	    gcc_emit_cbr_indirect(line, 
				  file,
				  isNegated, 
				  ess, 
				  bf_flag, 
				  m_lastEssState, 
				  pr,
				  i.inInstructionSequence());				   
	  }
	else 
	  {
	    // RPC specified hence an indirect call insn.

	    shared_ptr<const IndirectCallTargetList> targetList =
	      shared_dynamic_cast<const IndirectCallTargetList>(i.getTargetLabelList());

	    if(targetList)
	      {
		unsigned int call_use_regs[64];
		unsigned int call_return_regs[64];

		for(unsigned int reg=0; reg <= 63; reg++)
		  {
		    call_use_regs[reg]=0;
		    call_return_regs[reg]=0;
		  }
	    
		shared_ptr<const LabelList> labelList = targetList->getLabelList();

		//get the first target label name.
		const char* name = labelList->getLabel(0)->getName().c_str();

		shared_ptr<const PrototypeDirective> proto = 
		  searchForPrototype(i.getSrcLineNum(),
				     i.getSrcFile().c_str(),
				     name);

		computeCallUseRegSet(proto, call_use_regs);
		computeCallReturnRegSet(proto, call_return_regs);

		unsigned int argNum = computeNumOfArgRegs(proto) * 4; //in bytes.

		gcc_emit_cond_call_indirect(line,
					    file,
					    isNegated, 
					    ess, 
					    bf_flag, 
					    m_lastEssState, 
					    argNum, 
					    call_use_regs, 
					    call_return_regs,
					    pr,
					    i.inInstructionSequence());
	      }
	  }
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void
  M480GenRtlVisitor::visit(const M480JbciInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	genOperandRtl(i);

	checkCFlag(getAlo(), i.getFlags(), i.getSrcLineNum(), i.getSrcFile());

