testhound/alo/alo/octave/m480/M480GenRtlVisitor.cpp
	unsigned int ess = i.getEss()->getFlagNum();
	bool bf_flag = checkBFFlag(i.getFlags());

	OctaveInstruction::BranchProbability pr = i.getBranchProbability();

	if(!i.getDst()->isNullOperand())
	  {
	    unsigned int call_use_regs[64];
	    unsigned int call_return_regs[64];

	    for(unsigned int reg=0; reg <= 63; reg++)
	      {
		call_use_regs[reg]=0;		
		call_return_regs[reg]=0;
	      }

	    FindBranchLabelVisitor v;
	    i.getSrc1()->accept(v);

	    string labelName = v.getBranchTarget();

	    shared_ptr<const PrototypeDirective> proto = 
	      searchForPrototype(i.getSrcLineNum(), 
				 i.getSrcFile().c_str(),
				 labelName.c_str());

	    computeCallUseRegSet(proto, call_use_regs);
	    computeCallReturnRegSet(proto, call_return_regs);

	    unsigned int argNum = computeNumOfArgRegs(proto) * 4; //in bytes.

	    gcc_emit_cond_call_immediate(line,
					 file,
					 ess, 
					 bf_flag, 
					 m_lastEssState, 
					 argNum, 
					 call_use_regs, 
					 call_return_regs, 
					 pr,
					 i.inInstructionSequence());
	  }
	else
	  {
	    gcc_emit_cbr_immediate(line, 
				   file, 
				   ess, 
				   bf_flag, 
				   m_lastEssState,
				   pr,
				   i.inInstructionSequence());				   
	  }

      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }


  void
  M480GenRtlVisitor::visit(const M480JbcrInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	//bcr rsb ESS rpc <- call insn
	//bcr rpc ESS     <- return insn
	//bcr rsb ESS     <- jump insn

	i.getSrc1()->accept(*this); // rsb

	if(!i.getDst()->isNullOperand())
	  i.getDst()->accept(*this);  // rpc

	checkCFlag(getAlo(), i.getFlags(), i.getSrcLineNum(), i.getSrcFile());

	OctaveInstruction::BranchProbability pr = i.getBranchProbability();

	shared_ptr<const EssFlag> essFlag =
	  i.getEss();
      
	shared_ptr<const CbranchFlags> cbf =
	  shared_dynamic_cast<const CbranchFlags>(i.getFlags());
        
	bool bf_flag = checkBFFlag(i.getFlags());

	unsigned int rsb = i.getSrc1()->getRegNum();
	unsigned int ess = essFlag->getFlagNum();
	bool isNegated = essFlag->isNegated();

	if (rsb == 60 ||
	    rsb == 61 ||
	    rsb == 62)
	  {

	    // Make all return insns to branch to a common exit point;
	    const char* exitLabel = getCurrentFunction()->getExitLabel().c_str();
	    gcc_push_label(exitLabel);

	    storeReturnReg(i.getSrc1(), line, file);

	    gcc_emit_cond_return_indirect(line,
					  file,
					  ess,
					  m_lastEssState,
					  pr,
					  i.inInstructionSequence());
	  }
	else if (i.getDst()->isNullOperand()) 
	  {
	    gcc_emit_cbr_indirect(line,
				  file,
				  isNegated, 
				  ess, 
				  bf_flag, 
				  m_lastEssState, 
				  pr,
				  i.inInstructionSequence());				   
	  }
	else 
	  {
	    // RPC specified hence an indirect call.

	    shared_ptr<const IndirectCallTargetList> targetList =
	      shared_dynamic_cast<const IndirectCallTargetList>(i.getTargetLabelList());
	
	    if(targetList)
	      {
		unsigned int call_use_regs[64];
		unsigned int call_return_regs[64];
	    
		for(unsigned int reg=0; reg <= 63; reg++)
		  {
		    call_use_regs[reg]=0;
		    call_return_regs[reg]=0;
		  }
	    
		shared_ptr<const LabelList> labelList = targetList->getLabelList();

		//get the first entry label name.
		const char* name = labelList->getLabel(0)->getName().c_str();

		shared_ptr<const PrototypeDirective> proto = 
		  searchForPrototype(i.getSrcLineNum(), 
				     i.getSrcFile().c_str(),
				     name);

		computeCallUseRegSet(proto, call_use_regs);
		computeCallReturnRegSet(proto, call_return_regs);

		unsigned int argNum = computeNumOfArgRegs(proto) * 4; //in bytes.

		gcc_emit_cond_call_indirect(line,
					    file,
					    isNegated, 
					    ess, 
					    bf_flag, 
					    m_lastEssState, 
					    argNum, 
					    call_use_regs, 
					    call_return_regs, 
					    pr,
					    i.inInstructionSequence());
	      }
	  }
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void
  M480GenRtlVisitor::visit(const M480BiInstruction &i)
  {
    if(inFunction())
      {
	insnRaiseException("Cannot generate code for Bi instruction, Use pseudo Op Jbi",
			   i.getSrcLineNum(), i.getSrcFile());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void
  M480GenRtlVisitor::visit(const M480JbiInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	i.getSrc1()->accept(*this);
	i.getDst()->accept(*this);

	bool cd;
	if(!i.getCdFlag()->isNullOperand())
	  cd = true;
	else
	  cd = false;

	if (!i.getDst()->isNullOperand())
	  {
	    unsigned int call_use_regs[64];
	    unsigned int call_return_regs[64];

	    for(unsigned int reg=0; reg <= 63; reg++)
	      {
		call_use_regs[reg]=0;
		call_return_regs[reg]=0;
	      }

	    FindBranchLabelVisitor v;
	    i.getSrc1()->accept(v);

	    string labelName = v.getBranchTarget();
	    if (labelName != "")
	      {
		shared_ptr<const PrototypeDirective> proto = 
		  searchForPrototype(i.getLineNum(), 
				     i.getSrcFile().c_str(),
				     labelName.c_str());

		computeCallUseRegSet(proto, call_use_regs);
		computeCallReturnRegSet(proto, call_return_regs);

		unsigned int argNum = computeNumOfArgRegs(proto) * 4; //in bytes.

		gcc_emit_call_insn(line,
				   file,
				   cd, 
				   argNum, 
				   call_use_regs, 
				   call_return_regs, 
				   i.inInstructionSequence());
	      }
	  }
	else
	  {
	    gcc_emit_jump_insn(line, file, cd, i.inInstructionSequence());
	  }
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void
  M480GenRtlVisitor::visit(const M480BnziInstruction &i)
  {
    if(inFunction())
      {
	insnRaiseException("Cannot generate code for Bnzi instruction, Use pseudo Op Jbnzi",
			   i.getSrcLineNum(), i.getSrcFile());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }


  void
  M480GenRtlVisitor::visit(const M480JbnziInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	genOperandRtl(i);

	OctaveInstruction::BranchProbability pr = i.getBranchProbability();
    

	if(!i.getCmpReg()->isNullOperand())
	  {	
	    unsigned int call_use_regs[64];
	    unsigned int call_return_regs[64];
	
	    for(unsigned int reg=0; reg <= 63; reg++)
	      {
		call_use_regs[reg]=0;		
		call_return_regs[reg]=0;
	      }
	
