testhound/alo/alo/octave/m480/M480GenRtlVisitor.cpp
	    FindBranchLabelVisitor v;
	    i.getSrc2()->accept(v);
	
	    string labelName = v.getBranchTarget();
	    if (labelName != "")
	      {
		shared_ptr<const PrototypeDirective> proto = 
		  searchForPrototype(i.getSrcLineNum(), 
				     i.getSrcFile().c_str(),
				     labelName.c_str());
	    
		computeCallUseRegSet(proto, call_use_regs);
		computeCallReturnRegSet(proto, call_return_regs);
	    
		unsigned int argNum = computeNumOfArgRegs(proto) * 4; //in bytes.
	    
		gcc_emit_bnzi_call_insn(line, 
					file, 
					argNum, 
					call_use_regs, 
					call_return_regs, 
					pr,
					i.inInstructionSequence());
	      }
	  }
	else
	  {
	    gcc_emit_bnzi_jump_insn(line, file, pr, i.inInstructionSequence());
	  }
      }

    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void
  M480GenRtlVisitor::visit(const M480BnzrInstruction &i)
  {
    if(inFunction())
      {
	insnRaiseException("Cannot generate code for Bnzr instruction, Use pseudo Op Jbnzr",
			   i.getSrcLineNum(), i.getSrcFile());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void
  M480GenRtlVisitor::visit(const M480JbnzrInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

 
	//bnzr rsa rsb rpc <- call insn
	//bnzr rsa rpc     <- return insn
	//bnzr rsa rsb     <- conditional jump insn
    
	genOperandRtl(i);

	OctaveInstruction::BranchProbability pr = i.getBranchProbability();

	if(!i.getCmpReg()->isNullOperand())
	  {	
	    // RPC specified hence an indirect call.

	    shared_ptr<const IndirectCallTargetList> targetList =
	      shared_dynamic_cast<const IndirectCallTargetList>(i.getTargetLabelList());

	    if(targetList)
	      {
		unsigned int call_use_regs[64];
		unsigned int call_return_regs[64];

		for(unsigned int reg=0; reg <= 63; reg++)
		  {
		    call_use_regs[reg]=0;		
		    call_return_regs[reg]=0;
		  }
	    
		shared_ptr<const LabelList> labelList = targetList->getLabelList();

		//get the first entry label name.
		const char* name = labelList->getLabel(0)->getName().c_str();

		shared_ptr<const PrototypeDirective> proto = 
		  searchForPrototype(i.getSrcLineNum(), 
				     i.getSrcFile().c_str(),
				     name);

		computeCallUseRegSet(proto, call_use_regs);
		computeCallReturnRegSet(proto, call_return_regs);

		unsigned int argNum = computeNumOfArgRegs(proto) * 4; //in bytes.

		gcc_emit_bnzr_call_insn(line, 
					file, 
					argNum, 
					call_use_regs, 
					call_return_regs, 
					pr,
					i.inInstructionSequence());
	      }
	  }
	else
	  {
	    unsigned int rsb = i.getSrc2()->getRegNum();

	    if (rsb == 60 ||
		rsb == 61 ||
		rsb == 62)
	      {
		// Make all return insns to branch to a common exit point;
		const char* exitLabel = getCurrentFunction()->getExitLabel().c_str();
		gcc_push_label(exitLabel);

		storeReturnReg(i.getSrc2(), line, file);

		gcc_emit_bnzr_return_insn(line, file, pr, i.inInstructionSequence());
	      }
	    else
	      {
		gcc_emit_bnzr_jump_insn(line, file, pr, i.inInstructionSequence());
	      }
	  }
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void
  M480GenRtlVisitor::visit(const M480BrInstruction &i)
  {
    if(inFunction())
      {
	insnRaiseException("Cannot generate code for Br instruction, Use pseudo Op Jbr",
			   i.getSrcLineNum(), i.getSrcFile());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }


  void
  M480GenRtlVisitor::visit(const M480JtablebrInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (i.inInstructionSequence())
	  {
	    insnRaiseException("Cannot place branch insns in the noreorder region",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }


	i.getSrc1()->accept(*this);
	i.getDst()->accept(*this);
    
	gcc_emit_jtablebr(line, file, i.inInstructionSequence());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }


  void
  M480GenRtlVisitor::visit(const M480JtableRelativebrInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (i.inInstructionSequence())
	  {
	    insnRaiseException("Cannot place branch insns in the noreorder region",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }


	i.getSrc1()->accept(*this);
	i.getDst()->accept(*this);
    
	gcc_emit_jtable_relative_br(line, file, i.inInstructionSequence());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }


  void
  M480GenRtlVisitor::visit(const M480JbrInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	i.getSrc1()->accept(*this);

	if (!i.getDst()->isNullOperand())
	  i.getDst()->accept(*this);

	if (i.getDst()->isNullOperand())
	  {
	    // Make all return insns to branch to a common exit point;
	    const char* exitLabel = getCurrentFunction()->getExitLabel().c_str();
	    gcc_push_label(exitLabel);

	    unsigned int rpc;
	    shared_ptr<const Register> rpcReg = i.getSrc1();

	    if(rpcReg)
	      {
		rpc = rpcReg->getRegNum();
	    
		if(rpc == 60 ||
		   rpc == 61 ||
		   rpc == 62)
		  {
		    storeReturnReg(i.getSrc1(), line, file);
		  }
	      }

	    gcc_emit_indirect_jump_insn(line, file, i.inInstructionSequence());
	  }
	else
	  {	

	    // RPC specified hence an indirect call.

	    shared_ptr<const IndirectCallTargetList> targetList =
	      shared_dynamic_cast<const IndirectCallTargetList>(i.getTargetLabelList());

	    if(targetList)
	      {
		unsigned int call_use_regs[64];
		unsigned int call_return_regs[64];
	
		for(unsigned int reg=0; reg <= 63; reg++)
		  {
		    call_use_regs[reg]=0;		
		    call_return_regs[reg]=0;
		  }
	    
		shared_ptr<const LabelList> labelList = targetList->getLabelList();

		//get the first entry label name.
		const char* name = labelList->getLabel(0)->getName().c_str();

		shared_ptr<const PrototypeDirective> proto = 
		  searchForPrototype(i.getSrcLineNum(), 
				     i.getSrcFile().c_str(),
				     name);

		computeCallUseRegSet(proto, call_use_regs);
		computeCallReturnRegSet(proto, call_return_regs);

		unsigned int argNum = computeNumOfArgRegs(proto) * 4; //in bytes.

		gcc_emit_indirect_call_insn(line, file, argNum, 
					    call_use_regs, 
					    call_return_regs, 
					    i.inInstructionSequence());
	      }
	
