testhound/alo/alo/octave/m480/M480GenRtlVisitor.cpp
	  }
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void
  M480GenRtlVisitor::visit(const M480BrsInstruction &i)
  {
    if(inFunction())
      {
	insnRaiseException("Cannot generate code for Brs instruction, Use pseudo Op Jbrs",
			   i.getSrcLineNum(), i.getSrcFile());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void
  M480GenRtlVisitor::visit(const M480JbrsInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    i.getDst()->accept(*this);  // rpc
	
	    if (i.getDst()->isNullOperand()) 
	      {
		gcc_emit_brs_insn(line, file, i.inInstructionSequence());
	      }
	    else
	      {
		gcc_emit_brs_rpc_insn(line, file, i.inInstructionSequence());
	      }
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void
  M480GenRtlVisitor::visit(const M480BrslInstruction &i)
  {
    if(inFunction())
      {
	insnRaiseException("Cannot generate code for Brsl instruction, Use pseudo Op Jbrsl",
			   i.getSrcLineNum(), i.getSrcFile());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void
  M480GenRtlVisitor::visit(const M480JbrslInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    shared_ptr<const BrslFlags> brslFlags =
	      shared_dynamic_cast<const BrslFlags>(i.getBrslFlags());
    
	    bool unlink = false;
	    bool dlink = false;
	    bool flush = false;
	    bool pre = false;

	    if(brslFlags)
	      {
		BrslFlags::ConstIterator citer = brslFlags->begin();

		for(; citer != brslFlags->end(); citer++)
		  {
		    shared_ptr<const UNLNKFlag> unlink_flag =
		      shared_dynamic_cast<const UNLNKFlag>(*citer);
		    if(unlink_flag)
		      {
			unlink = true;
		      }

		    shared_ptr<const DLNKFlag> dlink_flag =
		      shared_dynamic_cast<const DLNKFlag>(*citer);
		    if(dlink_flag)
		      {
			dlink = true;
		      }

		    shared_ptr<const FLUSHFlag> flush_flag =
		      shared_dynamic_cast<const FLUSHFlag>(*citer);
		    if(flush_flag)
		      {
			flush = true;
		      }

		    shared_ptr<const PREFlag> pre_flag =
		      shared_dynamic_cast<const PREFlag>(*citer);
		    if(pre_flag)
		      {
			pre = true;
		      }
		  }
	      }	


	    //now emit brsl as an unspec
	    gcc_emit_brsl_insn(line, file, unlink, dlink, flush, pre, i.inInstructionSequence());

	  }
	else
	  genAsmRtlForInstruction(i);

    
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }


  void 
  M480GenRtlVisitor::visit(const M480BrspreInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    gcc_emit_brspre_insn(line, file, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480ByteswInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    i.getB3()->accept(*this);
	    i.getB2()->accept(*this);
	    i.getB1()->accept(*this);
	    i.getB0()->accept(*this);
	    i.getDst()->accept(*this);
	    i.getSrc1()->accept(*this);
    
	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());
	
	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    gcc_emit_bytesw_insn(line, file, lnk, mem, i.inInstructionSequence());
	  }    
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void
  M480GenRtlVisitor::visit(const M480BziInstruction &i)
  {
    if(inFunction())
      {
	insnRaiseException("Cannot generate code for Bzi instruction, Use pseudo Op Jbzi",
			   i.getSrcLineNum(), i.getSrcFile());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void
  M480GenRtlVisitor::visit(const M480JbziInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();
	
	genOperandRtl(i);
	
	OctaveInstruction::BranchProbability pr = i.getBranchProbability();
	
	if(!i.getCmpReg()->isNullOperand())
	  {
	    unsigned int call_use_regs[64];
	    unsigned int call_return_regs[64];
	    
	    for(unsigned int reg=0; reg <= 63; reg++)
	      {
		call_use_regs[reg]=0;		
		call_return_regs[reg]=0;
	      }
	
	    FindBranchLabelVisitor v;
	    i.getSrc2()->accept(v);
	
	    string labelName = v.getBranchTarget();
	    if (labelName != "")
	      {
		shared_ptr<const PrototypeDirective> proto = 
		  searchForPrototype(i.getSrcLineNum(), 
				     i.getSrcFile().c_str(),
				     labelName.c_str());
	    
		computeCallUseRegSet(proto, call_use_regs);
		computeCallReturnRegSet(proto, call_return_regs);
	    
		unsigned int argNum = computeNumOfArgRegs(proto) * 4; //in bytes.
	    
		gcc_emit_bzi_call_insn(line, file, argNum, 
				       call_use_regs, 
				       call_return_regs, 
				       pr,
				       i.inInstructionSequence());
	      } 
	  }
	else
	  {
	    gcc_emit_bzi_jump_insn(line, file, pr,i.inInstructionSequence());
	  }
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void
  M480GenRtlVisitor::visit(const M480BzrInstruction &i)
  {
    if(inFunction())
      {
	insnRaiseException("Cannot generate code for Bzr instruction, Use pseudo Op Jbzr",
			   i.getSrcLineNum(), i.getSrcFile());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void
  M480GenRtlVisitor::visit(const M480JbzrInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

 
	//bzr rsa rsb rpc <- call insn
	//bzr rsa rpc     <- return insn
	//bzr rsa rsb     <- conditional jump insn
    
	genOperandRtl(i);

	OctaveInstruction::BranchProbability pr = i.getBranchProbability();

	if(!i.getCmpReg()->isNullOperand())
	  {

	    // RPC specified hence an indirect call.

