testhound/alo/alo/octave/m480/M480GenRtlVisitor.cpp
	    shared_ptr<const IndirectCallTargetList> targetList =
	      shared_dynamic_cast<const IndirectCallTargetList>(i.getTargetLabelList());

	    if(targetList)
	      {
		unsigned int call_use_regs[64];
		unsigned int call_return_regs[64];
	
		for(unsigned int reg=0; reg <= 63; reg++)
		  {
		    call_use_regs[reg]=0;		
		    call_return_regs[reg]=0;
		  }
	    
		shared_ptr<const LabelList> labelList = targetList->getLabelList();

		//get the first entry label name.
		const char* name = labelList->getLabel(0)->getName().c_str();

		shared_ptr<const PrototypeDirective> proto = 
		  searchForPrototype(i.getSrcLineNum(), 
				     i.getSrcFile().c_str(),
				     name);

		computeCallUseRegSet(proto, call_use_regs);
		computeCallReturnRegSet(proto, call_return_regs);

		unsigned int argNum = computeNumOfArgRegs(proto) * 4; //in bytes.
	    
		gcc_emit_bzr_call_insn(line, file, argNum, 
				       call_use_regs, 
				       call_return_regs, 
				       pr,
				       i.inInstructionSequence());
	      }
	  }
	else
	  {
	    unsigned int rsb = i.getSrc2()->getRegNum();

	    if (rsb == 60 ||
		rsb == 61 ||
		rsb == 62)
	      {
		// Make all return insns to branch to a common exit point;
		const char* exitLabel = getCurrentFunction()->getExitLabel().c_str();
		gcc_push_label(exitLabel);

		storeReturnReg(i.getSrc1(), line, file);

		gcc_emit_bzr_return_insn(line, file, pr, i.inInstructionSequence());
	      }
	    else
	      {
		gcc_emit_bzr_jump_insn(line, file, pr, i.inInstructionSequence());
	      }
	  }
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480ClrbInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
 
	    bool isEssLive = i.isRegisterLive(REG_ESS);
	    m_lastEssState = ESS_CCUNS_MODE;

	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    gcc_emit_clrb_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

 
  void 
  M480GenRtlVisitor::visit(const M480ClrbiInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
 
	    bool isEssLive = i.isRegisterLive(REG_ESS);
	    m_lastEssState = ESS_CCUNS_MODE;

	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    gcc_emit_clrbi_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }


  void 
  M480GenRtlVisitor::visit(const M480CmovInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    unsigned int ess = i.getEssFlag()->getFlagNum();
	    bool isNegated = i.getEssFlag()->isNegated();
	
	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());
	
	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    gcc_emit_cmov_insn(line, file, isNegated, ess, m_lastEssState, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480CmoviInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    unsigned int ess = i.getEssFlag()->getFlagNum();
	    bool isNegated = i.getEssFlag()->isNegated();
	
	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }
	
	    gcc_emit_cmovi_insn(line, file, isNegated, ess, m_lastEssState, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }
  
  void 
  M480GenRtlVisitor::visit(const M480JcmpInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if(i.getBranchTarget()->isNullOperand())
	  {
	    insnRaiseException("Branch target not specified",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

	if (i.getAbcFlag()->isNullOperand())
	  {	
	    insnRaiseException("ABC flag not specified",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

	if (i.inInstructionSequence())
	  {
	    insnRaiseException("Cannot place branch insns in the noreorder region",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

	genOperandRtl(i);
	
	bool isEssLive = i.isRegisterLive(REG_ESS);
	m_lastEssState = ESS_CCUNS_MODE;

	OctaveInstruction::BranchProbability pr = i.getBranchProbability();  

	gcc_emit_cmp_branch_insn(line, file, isEssLive, pr, i.inInstructionSequence());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480CmpInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if(!i.getBranchTarget()->isNullOperand())
	  {
	    insnRaiseException("Cannot generate code for Cmp with branch target, Use Jcmp", 
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

