testhound/alo/alo/octave/m480/M480GenRtlVisitor.cpp
	if (!i.getAbcFlag()->isNullOperand())
	  {	
	    insnRaiseException("Cannot generate code for Cmp with ABC specified, Use Jcmp",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	
	    m_lastEssState = ESS_CCUNS_MODE;

	    if(! i.setRegistersLive())
	      {
		insnRaiseWarning("Flags set by this insn are unused subsequently, insn might get deleted", line, file);
	      }
	
	    gcc_emit_cmp_insn(line, file, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }


  void 
  M480GenRtlVisitor::visit(const M480JcmpiInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if(i.getBranchTarget()->isNullOperand())
	  {
	    insnRaiseException("Branch target not specified",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

	if (i.getAbcFlag()->isNullOperand())
	  {	
	    insnRaiseException("ABC flag not specified",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

	if (i.inInstructionSequence())
	  {
	    insnRaiseException("Cannot place branch insns in the noreorder region",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

	genOperandRtl(i);

	bool isEssLive = i.isRegisterLive(REG_ESS);
	m_lastEssState = ESS_CCUNS_MODE;

	OctaveInstruction::BranchProbability pr = i.getBranchProbability();

	gcc_emit_cmpi_branch_insn(line, file, isEssLive, pr,i.inInstructionSequence());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }
  
  void 
  M480GenRtlVisitor::visit(const M480CmpiInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if(!i.getBranchTarget()->isNullOperand())
	  {
	    insnRaiseException("Cannot generate code for Cmpi with branch target, Use Jcmpi", 
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

	if (!i.getAbcFlag()->isNullOperand())
	  {	
	    insnRaiseException("Cannot generate code for Cmpi with ABC specified, Use Jcmpi",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }
    
	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	
	    m_lastEssState = ESS_CCUNS_MODE;
	    
	    if(! i.setRegistersLive())
	      {
		insnRaiseWarning("Flags set by this insn are unused subsequently, insn might get deleted", line, file);
	      }
	
	    gcc_emit_cmpi_insn(line, file, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  
  void 
  M480GenRtlVisitor::visit(const M480CmprInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	//abc is not real ABC it is a type of compare flag...
    
	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	
	    shared_ptr<const AbcCompareFlag> abcFlag = 
	      shared_dynamic_cast<const AbcCompareFlag>(i.getAbcFlag());
	
	    shared_ptr<const SignFlag> signFlag =
	      shared_dynamic_cast<const SignFlag>(i.getSign());
	
	    bool isEssLive = i.isRegisterLive(REG_ESS);
	    m_lastEssState = ESS_CCUNS_MODE;
    
	    bool sign = false;
	
	    if(signFlag)
	      sign = true;

	    AbcCompareFlag::Abc_Compare_t abc;

	    if(abcFlag)
	      {
		abc = abcFlag->getABCFlagType();
	      }
	    else
	      {
		abc = AbcCompareFlag::BAEB;
	      }


	    if(! i.setRegistersLive())
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    gcc_emit_cmpr_insn(line, file, isEssLive, abc, sign, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }
  
  void 
  M480GenRtlVisitor::visit(const M480CmpriInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	//abc is not real ABC it is a type of compare flag...

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    if(! i.setRegistersLive())
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    shared_ptr<const AbcCompareFlag> abcFlag = 
	      shared_dynamic_cast<const AbcCompareFlag>(i.getAbcFlag());

	
	    shared_ptr<const SignFlag> signFlag =
	      shared_dynamic_cast<const SignFlag>(i.getSign());
	
	    //store the affect on flags...
	    bool isEssLive = i.isRegisterLive(REG_ESS);
	    m_lastEssState = ESS_CCUNS_MODE;
	
	    bool sign = false;

	    if(signFlag)
	      sign = true;

	    AbcCompareFlag::Abc_Compare_t abc;

	    if(abcFlag)
	      {
		abc = abcFlag->getABCFlagType();
	      }
	    else
	      {
		abc = AbcCompareFlag::BAEB;
	      }
	    gcc_emit_cmpri_insn(line, file, isEssLive, abc, sign, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }
    
  void 
  M480GenRtlVisitor::visit(const M480DepbInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    bool Z;

	    genOperandRtl(i);
	
	    if (i.getDepbFlag()->isNullOperand())
	      Z = false;
	    else
	      Z = true;
	
	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());
	
	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    gcc_emit_depb_insn(line, file, Z, lnk, mem, i.inInstructionSequence());
	
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }
   
  void 
  M480GenRtlVisitor::visit(const M480DepbiInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    bool Z;

	    genOperandRtl(i);

	    if (i.getDepbFlag()->isNullOperand())
	      Z = false;
	    else
	      Z = true;
	
	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }
    
	    gcc_emit_depbi_insn(line, file, Z, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }
  
  void 
  M480GenRtlVisitor::visit(const M480DmapInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

