testhound/alo/alo/octave/m480/M480GenRtlVisitor.cpp
	    gcc_emit_dmap_insn(line, file, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }
  
  void 
  M480GenRtlVisitor::visit(const M480DmasrInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    gcc_emit_dmasr_insn(line, file, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }
  
  void 
  M480GenRtlVisitor::visit(const M480Dmau0Instruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    gcc_emit_dmau0_insn(line, file, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }
  
  void 
  M480GenRtlVisitor::visit(const M480Dmau1Instruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();
	
	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	    
	    gcc_emit_dmau1_insn(line, file, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480ExtbInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    bool SIGN_flag;

	    genOperandRtl(i);

	    if (i.getSignFlag()->isNullOperand())
	      SIGN_flag = false;
	    else
	      SIGN_flag = true;
	
	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());
	
	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    gcc_emit_extb_insn(line, file, SIGN_flag, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480FfsInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    bool ZB;

	    genOperandRtl(i);

	    checkAbcFlag(getAlo(), i.getAbcFlag(), i.getSrcLineNum(), i.getSrcFile());
	
	    bool isEssLive = i.isRegisterLive(REG_ESS);
	    m_lastEssState = ESS_CCUNS_MODE;
	
	    if (i.getFindFlag()->isNullOperand())
	      ZB = false;
	    else
	      ZB = true;
	
	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());
	
	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    gcc_emit_ffs_insn(line, file, isEssLive, ZB, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void
  M480GenRtlVisitor::visit(const M480FlsInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();
	
	if (!i.inInstructionSequence())
	  {
	    bool ZB;

	    genOperandRtl(i);

	    checkAbcFlag(getAlo(), i.getAbcFlag(), i.getSrcLineNum(), i.getSrcFile());
	
	    bool isEssLive = i.isRegisterLive(REG_ESS);
	    m_lastEssState = ESS_CCUNS_MODE;
	
	    if (i.getFindFlag()->isNullOperand())
	      ZB = false;
	    else
	      ZB = true;
	
	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());
	
	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    gcc_emit_fls_insn(line, file, isEssLive, ZB, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }
  
  void 
  M480GenRtlVisitor::visit(const M480GetInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    bool RSCH_flag = false;
	    bool CLOSE_flag = false;
	    bool A_flag = false;
	    bool FPB_flag = false;
	    bool NT_flag = false;
	    bool NB_flag = false;
	    bool NC_flag = false;
	    bool S_flag = false;
	    bool CSB_flag = false;
	    bool DELETE_flag = false;
	    bool T_flag = false;

	    i.getRsa()->accept(*this);

	    shared_ptr<const TrafficScheduleFlags> tssFlags =
	      shared_dynamic_cast<const TrafficScheduleFlags>(i.getTssFlags());
	
	    if (tssFlags)
	      {
		TrafficScheduleFlags::ConstIterator citer = tssFlags->begin();
	
		for (; citer != tssFlags->end(); citer++)
		  {
		    if (shared_dynamic_cast<const RSCHFlag>(*citer))
		      RSCH_flag = true;

		    if (shared_dynamic_cast<const CLOSEFlag>(*citer))
		      CLOSE_flag = true;

		    if (shared_dynamic_cast<const AFlag>(*citer))
		      A_flag = true;
		
		    if (shared_dynamic_cast<const FPBFlag>(*citer))
		      FPB_flag = true;

		    if (shared_dynamic_cast<const NTFlag>(*citer))
		      NT_flag = true;
		
		    if (shared_dynamic_cast<const NBFlag>(*citer))
		      NB_flag = true;
		
		    if (shared_dynamic_cast<const NCFlag>(*citer))
		      NC_flag = true;
		
		    if (shared_dynamic_cast<const SFlag>(*citer))
		      S_flag = true;

		    if (shared_dynamic_cast<const CSBFlag>(*citer))
		      CSB_flag = true;
		
		    if (shared_dynamic_cast<const DELETEFlag>(*citer))
		      DELETE_flag = true;

		    if (shared_dynamic_cast<const TFlag>(*citer))
		      T_flag = true;
		  }
	      }

	    gcc_emit_get_insn_v4(line, file, 
				 RSCH_flag, CLOSE_flag, A_flag, FPB_flag, NT_flag, 
				 NB_flag, NC_flag, S_flag, CSB_flag, DELETE_flag, T_flag,
				 i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }


  void 
  M480GenRtlVisitor::visit(const M480Hec5Instruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

 
	if(!i.getBranchTarget()->isNullOperand())
	  {
	    insnRaiseException("Cannot generate code for Hec5 instruction with branch, Use pseudo Op Jhec5",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

	if (!i.inInstructionSequence())
	  {
	    bool CUME_flag;

	    i.getBranchTarget()->accept(*this);
	    i.getBytes()->accept(*this);
	    i.getSrc1()->accept(*this);
	    i.getDst()->accept(*this);
	
	    if (i.getCumeFlag()->isNullOperand())
	      CUME_flag = false;
	    else
	      CUME_flag = true;
	
