testhound/alo/alo/octave/m480/M480GenRtlVisitor.cpp
	    bool isEssLive = i.isRegisterLive(REG_ESS);
	    m_lastEssState = ESS_CCUNS_MODE;
	
	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }	
	
	    if(i.getBranchTarget()->isNullOperand())
	      {
		gcc_emit_hec5_insn(line, file, isEssLive, CUME_flag, lnk, mem, i.inInstructionSequence());
	      }
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480JHec5Instruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

 
	if(i.getBranchTarget()->isNullOperand())
	  {
	    insnRaiseException("Branch Target Not Provided",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

	if (!i.inInstructionSequence())
	  {
	    bool CUME_flag;
	  
	    i.getBranchTarget()->accept(*this);
	    i.getBytes()->accept(*this);
	    i.getSrc1()->accept(*this);
	    i.getDst()->accept(*this);
	  
	    if (i.getCumeFlag()->isNullOperand())
	      CUME_flag = false;
	    else
	      CUME_flag = true;
	
	    bool isEssLive = i.isRegisterLive(REG_ESS);
	    m_lastEssState = ESS_CCUNS_MODE;
	  
	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());
	  	
	    gcc_emit_hec5_br_insn(line, file, isEssLive, CUME_flag, lnk, mem, i.inInstructionSequence());
	  
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  //laih,lail,lih,lil insns can accept expns as src operands
  //  insn rN hi16(expN) (or)
  //  insn rN lo16(expN) (or)
  //  insn rN lo17(expN) (or)
  //  insn rN expN
  //in each case expN can be made of +/- operators
  //and label, signed and unsigned immediate operands.

  //calling accept method on src operand
  //pushes source expr rtx onto stack top which is
  //used in alo-parse.c

  void 
  M480GenRtlVisitor::visit(const M480LaihInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	
	    unsigned int rd = i.getDst()->getRegNum();
	
	    LinkFlag::Link_Flag_t lnk = getRegLink(rd);
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(rd);
	
	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    gcc_emit_laih_insn(line, file, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }  
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480LailInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	
	    unsigned int rd = i.getDst()->getRegNum();
	
	    LinkFlag::Link_Flag_t lnk = getRegLink(rd);
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(rd);

	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }
	
	    gcc_emit_lail_insn(line, file, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480LihInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	
	    unsigned int rd = i.getDst()->getRegNum();
	
	    LinkFlag::Link_Flag_t lnk = getRegLink(rd);
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(rd);

	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }
	
	    gcc_emit_lih_insn(line, file, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480LilInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	
	    unsigned int rd = i.getDst()->getRegNum();
	
	    LinkFlag::Link_Flag_t lnk = getRegLink(rd);
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(rd);

	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }
	
	    gcc_emit_lil_insn(line, file, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480LinkInstruction &i)
  {
    if(inFunction())
      {
	unsigned int excLine = i.getSrcLineNum();
	const char* excFile = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	
	    shared_ptr<const LinkFlag> linkFlag = i.getLinkFlag();
	    LinkFlag::Link_Flag_t lnk = linkFlag->getLinkFlagType();
	
	    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_ANY, lnk, i.getRegs());
	
	    genLinkInsn(excLine, excFile, LINK, i.getMem(), lnk, i.inInstructionSequence());
	  } 
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480LinksInstruction &i)
  {
    if(inFunction())
      {
	unsigned int excLine = i.getSrcLineNum();
	const char* excFile = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	
	    shared_ptr<const LinkFlag> linkFlag = i.getLinkFlag();
	    LinkFlag::Link_Flag_t lnk = linkFlag->getLinkFlagType();
	
