testhound/alo/alo/octave/m480/M480GenRtlVisitor.cpp
	    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_SPRAM, lnk, i.getRegs());
	
	    genLinkInsn(excLine, excFile, LINKS, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480LinkspInstruction &i)
  {
    if(inFunction())
      {
	unsigned int excLine = i.getSrcLineNum();
	const char* excFile = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	
	    shared_ptr<const LinkFlag> linkFlag = i.getLinkFlag();
	    LinkFlag::Link_Flag_t lnk = linkFlag->getLinkFlagType();
	
	    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_SPRAM, lnk, i.getRegs());
    
	    genLinkInsn(excLine, excFile, LINKSP, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }
  
  void 
  M480GenRtlVisitor::visit(const M480LinksplInstruction &i)
  {
    if(inFunction())
      {
	unsigned int excLine = i.getSrcLineNum();
	const char* excFile = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	
	    shared_ptr<const LinkFlag> linkFlag = i.getLinkFlag();
	    LinkFlag::Link_Flag_t lnk = linkFlag->getLinkFlagType();

	    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_SPRAM_LOCKED, lnk, i.getRegs());

	    genLinkInsn(excLine, excFile, LINKSPL, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480LinksrInstruction &i)
  {
    if(inFunction())
      {
	unsigned int excLine = i.getSrcLineNum();
	const char* excFile = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	
	    shared_ptr<const LinkFlag> linkFlag = i.getLinkFlag();
	    LinkFlag::Link_Flag_t lnk = linkFlag->getLinkFlagType();
	
	    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_SRAM, lnk, i.getRegs());
	
	    genLinkInsn(excLine, excFile, LINKSR, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480LinksdInstruction &i)
  {
    if(inFunction())
      {
	unsigned int excLine = i.getSrcLineNum();
	const char* excFile = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	
	    shared_ptr<const LinkFlag> linkFlag = i.getLinkFlag();
	    LinkFlag::Link_Flag_t lnk = linkFlag->getLinkFlagType();
	
	    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_SDRAM, lnk, i.getRegs());

	    genLinkInsn(excLine, excFile, LINKSD, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480LinkccInstruction &i)
  {
    if(inFunction())
      {
	unsigned int excLine = i.getSrcLineNum();
	const char* excFile = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	
	    shared_ptr<const LinkFlag> linkFlag = i.getLinkFlag();
	    LinkFlag::Link_Flag_t lnk = linkFlag->getLinkFlagType();
	
	    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_CCRAM, lnk, i.getRegs());

	    genLinkInsn(excLine, excFile, LINKCC, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }


  void 
  M480GenRtlVisitor::visit(const M480LinkcclInstruction &i)
  {
    if(inFunction())
      {
	unsigned int excLine = i.getSrcLineNum();
	const char* excFile = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
    
	    shared_ptr<const LinkFlag> linkFlag = i.getLinkFlag();
	    LinkFlag::Link_Flag_t lnk = linkFlag->getLinkFlagType();

	    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_CCRAM_LOCKED, lnk, i.getRegs());

	    genLinkInsn(excLine, excFile, LINKCCL, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480LinksioInstruction &i)
  {
    if(inFunction())
      {
	unsigned int excLine = i.getSrcLineNum();
	const char* excFile = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	
	    shared_ptr<const LinkFlag> linkFlag = i.getLinkFlag();
	    LinkFlag::Link_Flag_t lnk = linkFlag->getLinkFlagType();
	
	    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_SIO, lnk, i.getRegs());
    
	    genLinkInsn(excLine, excFile, LINKSIO, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480LmmInstruction &i)
  {
    if(inFunction())
      {
	if (!i.inInstructionSequence())
	  {
	    unsigned int excLine = i.getSrcLineNum();
	    const char* excFile = i.getSrcFile().c_str();

	    genOperandRtl(i);

	    shared_ptr<const LinkFlag> linkFlag = 
	      shared_dynamic_cast<const LinkFlag>(i.getLinkFlag());

	    LinkFlag::Link_Flag_t lnk;

	    if(linkFlag)
	      {
		lnk = linkFlag->getLinkFlagType();
	      }
	    else
	      {
		lnk = LinkFlag::CLEARLINK;
	      }


	    if(! i.setRegistersLive())
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", excLine, excFile);
	      }

	    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_ANY, lnk, i.getRegs());

	    genInsn(excLine, excFile, LMM, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480LmmspInstruction &i)
  {
    if(inFunction())
      {
	unsigned int excLine = i.getSrcLineNum();
	const char* excFile = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	
	    shared_ptr<const LinkFlag> linkFlag = 
	      shared_dynamic_cast<const LinkFlag>(i.getLinkFlag());
	
	    LinkFlag::Link_Flag_t lnk;

	    if(linkFlag)
	      {
		lnk = linkFlag->getLinkFlagType();
	      }
	    else
	      {
		lnk = LinkFlag::CLEARLINK;
	      }


	    if(! i.setRegistersLive())
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", excLine, excFile);
	      }

