testhound/alo/alo/octave/m480/M480GenRtlVisitor.cpp
	    updateLinkInfo(excLine, excFile, OctaveMemory::MEMTYPE_SPRAM, lnk, i.getRegs());

	    genInsn(excLine, excFile, LMMSP, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480LmmsplInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {    
	    genOperandRtl(i);

	    shared_ptr<const LinkFlag> linkFlag = 
	      shared_dynamic_cast<const LinkFlag>(i.getLinkFlag());

	    LinkFlag::Link_Flag_t lnk;

	    if(linkFlag)
	      {
		lnk = linkFlag->getLinkFlagType();
	      }
	    else
	      {
		lnk = LinkFlag::CLEARLINK;
	      }


	    if(! i.setRegistersLive())
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    updateLinkInfo(line, file, OctaveMemory::MEMTYPE_SPRAM_LOCKED, lnk, i.getRegs());

	    genInsn(line, file, LMMSPL, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480LmmsrInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    shared_ptr<const LinkFlag> linkFlag = 
	      shared_dynamic_cast<const LinkFlag>(i.getLinkFlag());
	
	    LinkFlag::Link_Flag_t lnk;

	    if(linkFlag)
	      {
		lnk = linkFlag->getLinkFlagType();
	      }
	    else
	      {
		lnk = LinkFlag::CLEARLINK;
	      }
	

	    if(! i.setRegistersLive())
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    updateLinkInfo(line, file, OctaveMemory::MEMTYPE_SRAM, lnk, i.getRegs());

	    genInsn(line, file, LMMSR, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480LmmsdInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    shared_ptr<const LinkFlag> linkFlag = 
	      shared_dynamic_cast<const LinkFlag>(i.getLinkFlag());
	
	    LinkFlag::Link_Flag_t lnk;

	    if(linkFlag)
	      {
		lnk = linkFlag->getLinkFlagType();
	      }
	    else
	      {
		lnk = LinkFlag::CLEARLINK;
	      }


	    if(! i.setRegistersLive())
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    updateLinkInfo(line, file, OctaveMemory::MEMTYPE_SDRAM, lnk, i.getRegs());
	
	    genInsn(line, file, LMMSD, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480LmmccInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    shared_ptr<const LinkFlag> linkFlag = 
	      shared_dynamic_cast<const LinkFlag>(i.getLinkFlag());

	    LinkFlag::Link_Flag_t lnk;

	    if(linkFlag)
	      {
		lnk = linkFlag->getLinkFlagType();
	      }
	    else
	      {
		lnk = LinkFlag::CLEARLINK;
	      }
	

	    if(! i.setRegistersLive())
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    updateLinkInfo(line, file, OctaveMemory::MEMTYPE_CCRAM, lnk, i.getRegs());
    
	    genInsn(line, file, LMMCC, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480LmmcclInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	
	    shared_ptr<const LinkFlag> linkFlag = 
	      shared_dynamic_cast<const LinkFlag>(i.getLinkFlag());
	
	    LinkFlag::Link_Flag_t lnk;

	    if(linkFlag)
	      {
		lnk = linkFlag->getLinkFlagType();
	      }
	    else
	      {
		lnk = LinkFlag::CLEARLINK;
	      }
	

	    if(! i.setRegistersLive())
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    updateLinkInfo(line, file, OctaveMemory::MEMTYPE_CCRAM_LOCKED, lnk, i.getRegs());

	    genInsn(line, file, LMMCCL, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480LmmsiInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	
	    shared_ptr<const LinkFlag> linkFlag = 
	      shared_dynamic_cast<const LinkFlag>(i.getLinkFlag());
	
	    LinkFlag::Link_Flag_t lnk;

	    if(linkFlag)
	      {
		lnk = linkFlag->getLinkFlagType();
	      }
	    else
	      {
		lnk = LinkFlag::CLEARLINK;
	      }
	

	    if(! i.setRegistersLive())
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    updateLinkInfo(line, file, OctaveMemory::MEMTYPE_SIO, lnk, i.getRegs());

	    genInsn(line, file, LMMSIO, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }


  void 
  M480GenRtlVisitor::visit(const M480LmmsInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    shared_ptr<const LinkFlag> linkFlag = 
	      shared_dynamic_cast<const LinkFlag>(i.getLinkFlag());
	
	    LinkFlag::Link_Flag_t lnk;
	
	    if(linkFlag)
	      {
		lnk = linkFlag->getLinkFlagType();
	      }
	    else
	      {
		lnk = LinkFlag::CLEARLINK;
	      }
	

	    if(! i.setRegistersLive())
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

