testhound/alo/alo/octave/m480/M480GenRtlVisitor.cpp
	    updateLinkInfo(line, file, OctaveMemory::MEMTYPE_SPRAM, lnk, i.getRegs());
	
	    genInsn(line, file, LMMS, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

 
  void 
  M480GenRtlVisitor::visit(const M480LspInstruction &i)
  {   
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    shared_ptr<const LinkFlag> linkFlag = 
	      shared_dynamic_cast<const LinkFlag>(i.getLinkFlag());
	
	    LinkFlag::Link_Flag_t lnk;

	    if(linkFlag)
	      {
		lnk = linkFlag->getLinkFlagType();
	      }
	    else
	      {
		lnk = LinkFlag::CLEARLINK;
	      }


	    if(! i.setRegistersLive())
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    updateLinkInfo(line, file, OctaveMemory::MEMTYPE_SPRAM, lnk, i.getRegs());

	    genInsn(line, file, LSP, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void
  M480GenRtlVisitor::visit(const M480LwihInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    i.getDst()->accept(*this);
	    i.getSrc()->accept(*this);

	    unsigned int rd = i.getDst()->getRegNum();

	    LinkFlag::Link_Flag_t lnk = getRegLink(rd);
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(rd);


	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    gcc_emit_lwih_insn(line, file, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }


  void
  M480GenRtlVisitor::visit(const M480LwilInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    i.getDst()->accept(*this);
	    i.getSrc()->accept(*this);

	    unsigned int rd = i.getDst()->getRegNum();

	    LinkFlag::Link_Flag_t lnk = getRegLink(rd);
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(rd);

	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }
	
	    gcc_emit_lwil_insn(line, file, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480MaxInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());


	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    if(!i.getModFlag()->isNullOperand())
	      {
		bool isEssLive = i.isRegisterLive(REG_ESS);
		m_lastEssState = ESS_CCUNS_MODE; 
		gcc_emit_max_modx_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	      }
	    else
	      {
		bool isEssLive = i.isRegisterLive(REG_ESS);
		m_lastEssState = ESS_CC_MODE;   
		gcc_emit_max_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	      }
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480MaxiInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    bool isEssLive = i.isRegisterLive(REG_ESS);
	    m_lastEssState = ESS_CCUNS_MODE;

	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());
    

	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    gcc_emit_maxi_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480MinInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());


	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    if(!i.getModFlag()->isNullOperand())
	      {
		bool isEssLive = i.isRegisterLive(REG_ESS);
		m_lastEssState = ESS_CCUNS_MODE;
		gcc_emit_min_modx_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	      }
	    else
	      {
		bool isEssLive = i.isRegisterLive(REG_ESS);
		m_lastEssState = ESS_CC_MODE;
		gcc_emit_min_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	      }
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480MiniInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

