testhound/alo/alo/octave/m480/M480GenRtlVisitor.cpp
	    if(!i.getModFlag()->isNullOperand())
	      gcc_emit_or_modx_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	    else
	      gcc_emit_or_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480OriInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    bool isEssLive = i.isRegisterLive(REG_ESS);
	    m_lastEssState = ESS_CCUNS_MODE;

	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    gcc_emit_ori_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480ParInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {    
	    i.getSrc1()->accept(*this);
	    i.getDst()->accept(*this);
	
	    bool isEssLive = i.isRegisterLive(REG_ESS);
	    m_lastEssState = ESS_CCUNS_MODE;
	
	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }
	
	    gcc_emit_par_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480PutcInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  { 
	    bool GZ_flag = false;
	    bool A_flag = false;
	    bool FP_flag = false;
	    bool OAM_flag = false;
	    bool NB_flag = false;
	    bool RP_flag = false;
	    bool I_flag = false;
	    bool FR_flag = false;
	    bool GR_flag = false;
	    bool GU_flag = false;
	    bool LOG_flag = false;

	    i.getRsa()->accept(*this);
	    i.getRsb()->accept(*this);
	
	    shared_ptr<const TrafficScheduleFlags> tssFlags =
	      shared_dynamic_cast<const TrafficScheduleFlags>(i.getTssFlags());

	    if (tssFlags)
	      {
		TrafficScheduleFlags::ConstIterator citer = tssFlags->begin();
	    
		for (; citer != tssFlags->end(); citer++)
		  {
		    if (shared_dynamic_cast<const GZFlag>(*citer))
		      GZ_flag = true;
		
		    if (shared_dynamic_cast<const AFlag>(*citer))
		      A_flag = true;
		
		    if (shared_dynamic_cast<const FPFlag>(*citer))
		      FP_flag = true;
		
		    if (shared_dynamic_cast<const OAMFlag>(*citer))
		      OAM_flag = true;
		
		    if (shared_dynamic_cast<const NBFlag>(*citer))
		      NB_flag = true;

		    if (shared_dynamic_cast<const RPFlag>(*citer))
		      RP_flag = true;

		    if (shared_dynamic_cast<const IFlag>(*citer))
		      I_flag = true;

		    if (shared_dynamic_cast<const FRFlag>(*citer))
		      FR_flag = true;

		    if (shared_dynamic_cast<const GRFlag>(*citer))
		      GR_flag = true;

		    if (shared_dynamic_cast<const GUFlag>(*citer))
		      GU_flag = true;

		    shared_ptr<const LOGFlag> log =
		      shared_dynamic_cast<const LOGFlag>(*citer);

		    if (shared_dynamic_cast<const LOGFlag>(*citer))
		      LOG_flag = true;
		  }

		gcc_emit_putc_insn_v4(line, file,
				      GZ_flag, A_flag, FP_flag, OAM_flag, NB_flag, RP_flag, 
				      I_flag, FR_flag, GR_flag, GU_flag, LOG_flag,
				      i.inInstructionSequence());
	      }
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480PutmInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  { 
	    bool FP_flag = false;
	    bool FR_flag = false;
	    bool GR_flag = false;
	    bool GU_flag = false;
	    bool GW_flag = false;
	    bool GZ_flag = false;
	    bool NB_flag = false;
	    bool NC_flag = false;
	    bool R_flag = false;
	    bool I_flag = false;

	    i.getRsa()->accept(*this);
	    i.getRsb()->accept(*this);
	
	    shared_ptr<const TrafficScheduleFlags> tssFlags =
	      shared_dynamic_cast<const TrafficScheduleFlags>(i.getTssFlags());
	
	    if (tssFlags)
	      {
		TrafficScheduleFlags::ConstIterator citer = tssFlags->begin();
	    
		for (; citer != tssFlags->end(); citer++)
		  {
		    if (shared_dynamic_cast<const FPFlag>(*citer))
		      FP_flag = true;
		
		    if (shared_dynamic_cast<const FRFlag>(*citer))
		      FR_flag = true;
		
		    if (shared_dynamic_cast<const GRFlag>(*citer))
		      GR_flag = true;
		
		    if (shared_dynamic_cast<const GUFlag>(*citer))
		      GU_flag = true;
		
		    if (shared_dynamic_cast<const GWFlag>(*citer))
		      GW_flag = true;
		
		    if (shared_dynamic_cast<const GZFlag>(*citer))
		      GZ_flag = true;
		
		    if (shared_dynamic_cast<const NBFlag>(*citer))
		      NB_flag = true;
		
		    if (shared_dynamic_cast<const NCFlag>(*citer))
		      NC_flag = true;
		
		    if (shared_dynamic_cast<const RFlag>(*citer))
		      R_flag = true;
		
		    if (shared_dynamic_cast<const IFlag>(*citer))
		      I_flag = true;
		  }
	    
		gcc_emit_putm_insn(line, file, FP_flag, FR_flag, GR_flag, GU_flag, GW_flag, 
				   GZ_flag, NB_flag, NC_flag, R_flag, I_flag,
				   i.inInstructionSequence());
	      }
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480PutpInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  { 
	    bool GZ_flag = false;
	    bool A_flag = false;
	    bool FP_flag = false;
	    bool OAM_flag = false;
	    bool NB_flag = false;
	    bool RP_flag = false;
	    bool I_flag = false;
	    bool FR_flag = false;
	    bool GR_flag = false;
	    bool GU_flag = false;
	    bool LOG_flag = false;
	
