testhound/alo/alo/octave/m480/M480GenRtlVisitor.cpp
	    i.getRsa()->accept(*this);
	    i.getRsb()->accept(*this);
	
	    shared_ptr<const TrafficScheduleFlags> tssFlags =
	      shared_dynamic_cast<const TrafficScheduleFlags>(i.getTssFlags());
	
	    if (tssFlags)
	      {
		TrafficScheduleFlags::ConstIterator citer = tssFlags->begin();
	    
		for (; citer != tssFlags->end(); citer++)
		  {
		    if (shared_dynamic_cast<const GZFlag>(*citer))
		      GZ_flag = true;
		
		    if (shared_dynamic_cast<const AFlag>(*citer))
		      A_flag = true;
		
		    if (shared_dynamic_cast<const FPFlag>(*citer))
		      FP_flag = true;
		
		    if (shared_dynamic_cast<const OAMFlag>(*citer))
		      OAM_flag = true;
		
		    if (shared_dynamic_cast<const NBFlag>(*citer))
		      NB_flag = true;

		    if (shared_dynamic_cast<const RPFlag>(*citer))
		      RP_flag = true;

		    if (shared_dynamic_cast<const IFlag>(*citer))
		      I_flag = true;

		    if (shared_dynamic_cast<const FRFlag>(*citer))
		      FR_flag = true;

		    if (shared_dynamic_cast<const GRFlag>(*citer))
		      GR_flag = true;

		    if (shared_dynamic_cast<const GUFlag>(*citer))
		      GU_flag = true;

		    shared_ptr<const LOGFlag> log =
		      shared_dynamic_cast<const LOGFlag>(*citer);
		
		    if (shared_dynamic_cast<const LOGFlag>(*citer))
		      LOG_flag = true;
		  }

		gcc_emit_putp_insn(line, file, GZ_flag, A_flag, FP_flag, OAM_flag, NB_flag, RP_flag, 
				   I_flag, FR_flag, GR_flag, GU_flag, LOG_flag,
				   i.inInstructionSequence());
	      }
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480PutdInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  { 
	    bool GZ_flag = false;
	    bool A_flag = false;
	    bool FP_flag = false;
	    bool OAM_flag = false;
	    bool NB_flag = false;
	    bool RP_flag = false;
	    bool I_flag = false;
	    bool FR_flag = false;
	    bool GR_flag = false;
	    bool GU_flag = false;
	    bool LOG_flag = false;
	
	    i.getRsa()->accept(*this);
	    i.getRsb()->accept(*this);
	
	    shared_ptr<const TrafficScheduleFlags> tssFlags =
	      shared_dynamic_cast<const TrafficScheduleFlags>(i.getTssFlags());
	
	    if (tssFlags)
	      {
		TrafficScheduleFlags::ConstIterator citer = tssFlags->begin();
	    
		for (; citer != tssFlags->end(); citer++)
		  {
		    if (shared_dynamic_cast<const GZFlag>(*citer))
		      GZ_flag = true;
		
		    if (shared_dynamic_cast<const AFlag>(*citer))
		      A_flag = true;
		
		    if (shared_dynamic_cast<const FPFlag>(*citer))
		      FP_flag = true;
		
		    if (shared_dynamic_cast<const OAMFlag>(*citer))
		      OAM_flag = true;
		
		    if (shared_dynamic_cast<const NBFlag>(*citer))
		      NB_flag = true;

		    if (shared_dynamic_cast<const RPFlag>(*citer))
		      RP_flag = true;

		    if (shared_dynamic_cast<const IFlag>(*citer))
		      I_flag = true;

		    if (shared_dynamic_cast<const FRFlag>(*citer))
		      FR_flag = true;

		    if (shared_dynamic_cast<const GRFlag>(*citer))
		      GR_flag = true;

		    if (shared_dynamic_cast<const GUFlag>(*citer))
		      GU_flag = true;

		    shared_ptr<const LOGFlag> log =
		      shared_dynamic_cast<const LOGFlag>(*citer);
		
		    if (shared_dynamic_cast<const LOGFlag>(*citer))
		      LOG_flag = true;
		  }

		// FIXME: Add PUTD to GCC, fix this call.
		gcc_emit_putp_insn(line, file, GZ_flag, A_flag, FP_flag, OAM_flag, NB_flag, RP_flag, 
				   I_flag, FR_flag, GR_flag, GU_flag, LOG_flag,
				   i.inInstructionSequence());
	      }
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480RandInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
 
	    bool isEssLive = i.isRegisterLive(REG_ESS);
	    m_lastEssState = ESS_CC_MODE;

	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    gcc_emit_rand_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480RandiInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    bool isEssLive = i.isRegisterLive(REG_ESS);
	    m_lastEssState = ESS_CC_MODE;

	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    gcc_emit_randi_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480RintInstruction &i)
  {
    if(inFunction())
      {
	insnRaiseException("Cannot generate code for Rint instruction, Use pseudo Op Jrint",
			   i.getSrcLineNum(), i.getSrcFile());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480JrintInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	// Make all return insns to branch to a common exit point;
	const char* exitLabel = getCurrentFunction()->getExitLabel().c_str();
	gcc_push_label(exitLabel);


	if (!i.inInstructionSequence())
	  {
   
