testhound/alo/alo/octave/m480/M480GenRtlVisitor.cpp
	    bool isEssLive = i.isRegisterLive(REG_ESS);
	    m_lastEssState = ESS_CCUNS_MODE;
  
	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    gcc_emit_shrai_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }
  
  void 
  M480GenRtlVisitor::visit(const M480SmmInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    LinkFlag::Link_Flag_t lnk;
	    lnk = LinkFlag::NOLINK;
	
	    genInsn(line, file, SMM, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }
  
  void 
  M480GenRtlVisitor::visit(const M480SmmsInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    LinkFlag::Link_Flag_t lnk;
	    lnk = LinkFlag::NOLINK;

	    genInsn(line, file, SMMS, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }
  
  void 
  M480GenRtlVisitor::visit(const M480SmmspInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    LinkFlag::Link_Flag_t lnk;
	    lnk = LinkFlag::NOLINK;

	    genInsn(line, file, SMMSP, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }
  
  void 
  M480GenRtlVisitor::visit(const M480SmmsplInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    LinkFlag::Link_Flag_t lnk;
	    lnk = LinkFlag::NOLINK;
    
	    genInsn(line, file, SMMSPL, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }
  
  void 
  M480GenRtlVisitor::visit(const M480SmmsrInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    LinkFlag::Link_Flag_t lnk;
	    lnk = LinkFlag::NOLINK;

	    genInsn(line, file, SMMSR, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }
  
  void 
  M480GenRtlVisitor::visit(const M480SmmsdInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    LinkFlag::Link_Flag_t lnk;
	    lnk = LinkFlag::NOLINK;

	    genInsn(line, file, SMMSD, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }
  
  void 
  M480GenRtlVisitor::visit(const M480SmmccInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    LinkFlag::Link_Flag_t lnk;
	    lnk = LinkFlag::NOLINK;

	    genInsn(line, file, SMMCC, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }
  
  void 
  M480GenRtlVisitor::visit(const M480SmmcclInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	
	    LinkFlag::Link_Flag_t lnk;
	    lnk = LinkFlag::NOLINK;
    
	    genInsn(line, file, SMMCCL, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }
  
  void 
  M480GenRtlVisitor::visit(const M480SmmsiInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    LinkFlag::Link_Flag_t lnk;
	    lnk = LinkFlag::NOLINK;
	
	    genInsn(line, file, SMMSIO, i.getMem(), lnk, i.inInstructionSequence());
	  } 
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480SspInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    LinkFlag::Link_Flag_t lnk;
	    lnk = LinkFlag::NOLINK;
	
	    genInsn(line, file, SSP, i.getMem(), lnk, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480SubInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

