testhound/alo/alo/octave/m480/M480GenRtlVisitor.cpp
	    if(!i.getModFlag()->isNullOperand())
	      {
		bool isEssLive = i.isRegisterLive(REG_ESS);
		m_lastEssState = ESS_CCUNS_MODE;
		gcc_emit_sub_modx_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	      }
	    else
	      {
		bool isEssLive = i.isRegisterLive(REG_ESS);
		m_lastEssState = ESS_CC_MODE;
		gcc_emit_sub_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	      }
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480SubbInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {     
	    genOperandRtl(i);

	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());


	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    if(!i.getModFlag()->isNullOperand())
	      {
		bool isEssLive = i.isRegisterLive(REG_ESS);
		m_lastEssState = ESS_CCUNS_MODE;
		gcc_emit_subb_modx_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	      }
	    else
	      {
		bool isEssLive = i.isRegisterLive(REG_ESS);
		m_lastEssState = ESS_CC_MODE;
		gcc_emit_subb_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	      }
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480SubbiInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {     
	    genOperandRtl(i);

	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    if(!i.getModFlag()->isNullOperand())
	      {
		bool isEssLive = i.isRegisterLive(REG_ESS);
		m_lastEssState = ESS_CCUNS_MODE;
		gcc_emit_subbi_modx_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	      }
	    else
	      {
		bool isEssLive = i.isRegisterLive(REG_ESS);
		m_lastEssState = ESS_CC_MODE;
		gcc_emit_subbi_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	      }
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480SubiInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());


	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    if(!i.getModFlag()->isNullOperand())
	      {
		bool isEssLive = i.isRegisterLive(REG_ESS);
		m_lastEssState = ESS_CCUNS_MODE;
		gcc_emit_subi_modx_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	      }
	    else
	      {
		bool isEssLive = i.isRegisterLive(REG_ESS);
		m_lastEssState = ESS_CC_MODE;
		gcc_emit_subi_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	      }
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480SublInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if(!i.getBranchTarget()->isNullOperand())
	  {
	    insnRaiseException("Cannot generate code for Subl instruction with branch, Use pseudo Op Jsubl",
			       i.getSrcLineNum(), i.getSrcFile());
	
	    return;
	  }

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	
	    bool isEssLive = i.isRegisterLive(REG_ESS);
	    m_lastEssState = ESS_CC_MODE;
	
	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());


	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }
	
	    gcc_emit_subl_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480JsublInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if(i.getBranchTarget()->isNullOperand())
	  {
	    insnRaiseException("Branch target not specified",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

	if (i.inInstructionSequence())
	  {
	    insnRaiseException("Cannot place branch insns in the noreorder region",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

	genOperandRtl(i);
    
	bool isEssLive = i.isRegisterLive(REG_ESS);
	m_lastEssState = ESS_CC_MODE;

	LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

	OctaveInstruction::BranchProbability pr = i.getBranchProbability();

	gcc_emit_subl_br_insn(line, file, isEssLive, lnk, mem, pr, i.inInstructionSequence());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480SubliInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if(!i.getBranchTarget()->isNullOperand())
	  {
	    insnRaiseException("Cannot generate code for Subli instruction with branch, Use pseudo Op Jsubli",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	
