testhound/alo/alo/octave/m480/M480GenRtlVisitor.cpp
	    bool isEssLive = i.isRegisterLive(REG_ESS);
	    m_lastEssState = ESS_CC_MODE;
	
	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());
	
	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    gcc_emit_subli_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480JsubliInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if(i.getBranchTarget()->isNullOperand())
	  {
	    insnRaiseException("Branch target not specified",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

	if (i.inInstructionSequence())
	  {
	    insnRaiseException("Cannot place branch insns in the noreorder region",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

	genOperandRtl(i);
    
	bool isEssLive = i.isRegisterLive(REG_ESS);
	m_lastEssState = ESS_CC_MODE;

	LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());
 
	OctaveInstruction::BranchProbability pr = i.getBranchProbability();

	gcc_emit_subli_br_insn(line, file, isEssLive, lnk, mem, pr, i.inInstructionSequence());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480SubwhInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if(!i.getBranchTarget()->isNullOperand())
	  {
	    insnRaiseException("Cannot generate code for Subwh instruction with branch, Use pseudo Op Jsubwh",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	
	    bool isEssLive = i.isRegisterLive(REG_ESS);
	    m_lastEssState = ESS_CC_CY_MODE;
	
	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());
	
	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    gcc_emit_subwh_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480JsubwhInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if(i.getBranchTarget()->isNullOperand())
	  {
	    insnRaiseException("Branch target not specified",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

	if (i.inInstructionSequence())
	  {
	    insnRaiseException("Cannot place branch insns in the noreorder region",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

	genOperandRtl(i);
    
	bool isEssLive = i.isRegisterLive(REG_ESS);
	m_lastEssState = ESS_CC_CY_MODE;
    
	LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

	OctaveInstruction::BranchProbability pr = i.getBranchProbability();

	gcc_emit_subwh_br_insn(line, file, isEssLive, lnk, mem, pr, i.inInstructionSequence());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }


  void 
  M480GenRtlVisitor::visit(const M480SubwhiInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if(!i.getBranchTarget()->isNullOperand())
	  {
	    insnRaiseException("Cannot generate code for Subwhi instruction with branch, Use pseudo Op Jsubwhi",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    bool isEssLive = i.isRegisterLive(REG_ESS);
	    m_lastEssState = ESS_CC_CY_MODE;

	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

       
	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    gcc_emit_subwhi_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480JsubwhiInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if(i.getBranchTarget()->isNullOperand())
	  {
	    insnRaiseException("Branch target not specified",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

	if (i.inInstructionSequence())
	  {
	    insnRaiseException("Cannot place branch insns in the noreorder region",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

	genOperandRtl(i);
    
	bool isEssLive = i.isRegisterLive(REG_ESS);
	m_lastEssState = ESS_CC_CY_MODE;
    
	LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());
        
	OctaveInstruction::BranchProbability pr = i.getBranchProbability();

	gcc_emit_subwhi_br_insn(line, file, isEssLive, lnk, mem, pr, i.inInstructionSequence());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480SubwlInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if(!i.getBranchTarget()->isNullOperand())
	  {
	    insnRaiseException("Cannot generate code for Subwl instruction, Use pseudo Op Jsubwl",
			       i.getSrcLineNum(), i.getSrcFile());
	  }

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);
	
