testhound/alo/alo/octave/m480/M480GenRtlVisitor.cpp
	    bool isEssLive = i.isRegisterLive(REG_ESS);
	    m_lastEssState = ESS_CC_CY_MODE;
	
	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());
	       
	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    gcc_emit_subwwi_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480JsubwwiInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if(i.getBranchTarget()->isNullOperand())
	  {
	    insnRaiseException("Branch target not specified",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

	if (i.inInstructionSequence())
	  {
	    insnRaiseException("Cannot place branch insns in the noreorder region",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

	genOperandRtl(i);
    
	bool isEssLive = i.isRegisterLive(REG_ESS);
	m_lastEssState = ESS_CC_CY_MODE;
    
	LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());
        
	OctaveInstruction::BranchProbability pr = i.getBranchProbability();

	gcc_emit_subwwi_br_insn(line, file, isEssLive, lnk, mem, pr, i.inInstructionSequence());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480TclrbInstruction &i)
  {
    if(inFunction())
      {
	insnRaiseException("Cannot generate code for Tclrb instruction, Use pseudo Op Jclrb", 
			   i.getSrcLineNum(), i.getSrcFile());
      } 
    else
      {
	genRtlForGlobalInsn(i);
      }
  }
 
  void 
  M480GenRtlVisitor::visit(const M480JtclrbInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (i.inInstructionSequence())
	  {
	    insnRaiseException("Cannot place branch insns in the noreorder region",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

	genOperandRtl(i);

	bool isEssLive = i.isRegisterLive(REG_ESS);

	OctaveInstruction::BranchProbability pr = i.getBranchProbability();

	m_lastEssState = ESS_CCUNS_MODE;

	gcc_emit_tclrb_br_insn(line, file, isEssLive, pr, i.inInstructionSequence());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480TsetbInstruction &i)
  {
    if(inFunction())
      {
	insnRaiseException("Cannot generate code for Tsetb instruction, Use pseudo Op Jtsetb", 
			   i.getSrcLineNum(), i.getSrcFile());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480JtsetbInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (i.inInstructionSequence())
	  {
	    insnRaiseException("Cannot place branch insns in the noreorder region",
			       i.getSrcLineNum(), i.getSrcFile());
	    return;
	  }

	genOperandRtl(i);    

	OctaveInstruction::BranchProbability pr = i.getBranchProbability();

	bool isEssLive = i.isRegisterLive(REG_ESS);

	m_lastEssState = ESS_CCUNS_MODE;

	gcc_emit_tsetb_br_insn(line, file, isEssLive, pr, i.inInstructionSequence());
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480UnlinkInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    shared_ptr<const MultiRegister> mRegs = i.getRegs();

	    unsigned int count = mRegs->getNumRegs();

	    unsigned int rd1 = mRegs->getFirstRegNum();
	    unsigned int rdN = rd1 + count - 1;

	    unsigned int reg;
	    for(reg = rd1; reg <= rdN; reg++)
	      {
		setRegLink(reg, LinkFlag::NOLINK);
	      }
	
	    gcc_emit_unlink_insn(line, file, count, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480XorInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    bool isEssLive = i.isRegisterLive(REG_ESS);
	    m_lastEssState = ESS_CCUNS_MODE;

	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    if(!i.getModFlag()->isNullOperand())
	      gcc_emit_xor_modx_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	    else
	      gcc_emit_xor_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::visit(const M480XoriInstruction &i)
  {
    if(inFunction())
      {
	unsigned int line = i.getSrcLineNum();
	const char* file = i.getSrcFile().c_str();

	if (!i.inInstructionSequence())
	  {
	    genOperandRtl(i);

	    bool isEssLive = i.isRegisterLive(REG_ESS);
	    m_lastEssState = ESS_CCUNS_MODE;

	    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
	    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());
       
	    if(! i.setRegistersLive() && lnk == LinkFlag::NOLINK)
	      {
		insnRaiseWarning("Destination operands of this insn are unused subsequently, insn might get deleted", line, file);
	      }

	    gcc_emit_xori_insn(line, file, isEssLive, lnk, mem, i.inInstructionSequence());
	  }
	else
	  genAsmRtlForInstruction(i);
      }
    else
      {
	genRtlForGlobalInsn(i);
      }
  }

  void 
  M480GenRtlVisitor::genRtlForGlobalInsn(const LlirInstruction &insn)
  {
    ostringstream d_stream;
    M480RtlPrintVisitor pv(d_stream);
    insn.accept(pv);

