testhound/alo/alo/octave/m480/M480GenRtlVisitor.cpp
    gcc_emit_global_asm_directive((d_stream.str()).c_str());
  }

  void 
  M480GenRtlVisitor::updateLinkInfo(unsigned int excLine,
				    const char* excFile,
				    OctaveMemory::MemType_t  mem,
				    LinkFlag::Link_Flag_t lnk,
				    shared_ptr<const MultiRegister> mRegs)
  {
    unsigned int rd1 = mRegs->getFirstRegNum();
    unsigned int rdN = rd1 + mRegs->getNumRegs() - 1;


    if(rdN > 63)
      {
	//Note: links can only be set between hard registers and memory

	//generating rtl for lmm/smm instruction containing
	//pseudo registers... make sure that lnk flag is 
	//not specified in such instructions

	if(lnk == LinkFlag::LNK1 || 
	   lnk == LinkFlag::LNK2 ||
	   lnk == LinkFlag::LNK3)
	  {
	    OctaveAlo& alo = getAlo();
	    char *excStr = new char[128];
	    shared_ptr<std::exception> exc; 
	    
	    sprintf(excStr, "Cannot associate memory links to pseudo registers");
	    exc = shared_ptr<IllegalInsn> 
	      (new IllegalInsn(excStr, excLine, excFile, __LINE__, __FILE__));
	    alo.logException(exc);
	    delete excStr;
	  }
      }

    if(lnk != LinkFlag::NOLINK)
      {
	if(lnk == LinkFlag::CLEARLINK)
	  {
	    for(unsigned int reg = rd1; reg <= rdN; reg++)
	      {
		setRegLink(reg, LinkFlag::NOLINK);
		setRegisterLinkedMemoryType(reg, OctaveMemory::MEMTYPE_ANY);
	      }
	  }
	else 
	  {
	    //set links...
	    for(unsigned int reg = rd1; reg <= rdN; reg++)
	      {
		setRegLink(reg, lnk);
		setRegisterLinkedMemoryType(reg, mem);
	      }
	  }
      }
  }



  void
  M480GenRtlVisitor::genInsn(unsigned int line,
			     const char* file, 
			     RTL_INSN insn,
			     shared_ptr<const OctaveMemory> mem,
			     LinkFlag::Link_Flag_t lnk,
			     unsigned int inSequence)
  {

    //This is needed to access correct index gen fn
    if(lnk == LinkFlag::CLEARLINK)
      lnk = LinkFlag::NOLINK;

    shared_ptr<const RegPlusOffsetIndirect> regOffset =
      shared_dynamic_cast<const RegPlusOffsetIndirect>(mem);

    shared_ptr<const Base2PlusOffset> base2Offset =
      shared_dynamic_cast<const Base2PlusOffset>(mem);

    shared_ptr<const Base3PlusOffset> base3Offset =
      shared_dynamic_cast<const Base3PlusOffset>(mem);

    shared_ptr<const ImpliedBase2Offset> impOffset = 
      shared_dynamic_cast<const ImpliedBase2Offset>(mem);

    if (impOffset)
      {
	// This is a "plain" offset argument that will become a BASE2 in the backend assembler.
	// convert it to a Base2PlusOffset.  Similar hack used in M4?0SemanticVisitor.cpp .
	assert(!base2Offset);
	base2Offset = shared_ptr<Base2PlusOffset>  (new Base2PlusOffset(impOffset->getOffset()));
      }

    if(regOffset)
      {
	if(insn == LMM || insn == SMM)
	  {
	    insnRaiseWarning("Unknown memory region for smm. Please use smm pseudo-op indicating memory region.",
			     line, file);
	  }

	gcc_emit_reg_offset_insn(line, file, insn, lnk, inSequence);
      }
    else if(base2Offset)
      {
	gcc_emit_base2_offset_insn(line, file, insn, lnk, inSequence);
      }
    else if(base3Offset)
      {
	gcc_emit_base3_offset_insn(line, file, insn, lnk, inSequence);
      }
  }


  void
  M480GenRtlVisitor::genLinkInsn(unsigned int line,
				 const char* file,
				 RTL_INSN insn,
				 shared_ptr<const OctaveMemory> mem,
				 LinkFlag::Link_Flag_t lnk,
				 unsigned int inSequence)
  {
    shared_ptr<const RegPlusOffsetIndirect> regOffset =
      shared_dynamic_cast<const RegPlusOffsetIndirect>(mem);
    
    shared_ptr<const Base2PlusOffset> base2Offset =
      shared_dynamic_cast<const Base2PlusOffset>(mem);

    shared_ptr<const Base3PlusOffset> base3Offset =
      shared_dynamic_cast<const Base3PlusOffset>(mem);


    if(regOffset)
      {
	if(insn == LINKS)
	  gcc_emit_links_reg_offset_insn(line, file, insn, lnk, inSequence);
	else
	  gcc_emit_link_reg_offset_insn(line, file, insn, lnk, inSequence);
      }
    else if(base2Offset)
      {
	gcc_emit_link_base2_offset_insn(line, file, insn, lnk, inSequence);
      }
    else if(base3Offset)
      {
	gcc_emit_link_base3_offset_insn(line, file, insn, lnk, inSequence);
      }
  }

  void
  M480GenRtlVisitor::checkAbcFlag(OctaveAlo &alo,
				  shared_ptr<const LlirOperand> opnd, 
				  unsigned int excLine,
				  const string &excFile) const
  {
    shared_ptr<std::exception> exc; 

    shared_ptr<const AbcFlag> abcFlag = 
      shared_dynamic_cast<const AbcFlag>(opnd);
   
    if(abcFlag)
      {    
	char *excStr = new char[128];
	sprintf(excStr, "Cannot generate code for ABC Instructions");
	exc = shared_ptr<IllegalInsn> 
	  (new IllegalInsn(excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	alo.logException(exc);
	delete excStr;
      }
  }

  void
  M480GenRtlVisitor::checkCFlag(OctaveAlo &alo,
				shared_ptr<const LlirOperand> opnd, 
				unsigned int excLine,
				const string &excFile) const
  {
    shared_ptr<std::exception> exc; 
      
    shared_ptr<const CbranchFlags> cbf =
      shared_dynamic_cast<const CbranchFlags> (opnd);

    bool cFlag = false;

    if(cbf)
      {

	CbranchFlags::ConstIterator cbfIter = cbf->begin();
	
	for(; cbfIter != cbf->end(); cbfIter++)
	  {
	    shared_ptr<const CFlag> cflag = shared_dynamic_cast<const CFlag>(*cbfIter);
	    if(cflag)
	      {
		cFlag = true;
	      }
	  }
      }
   
    if(cFlag)
      {    
	char *excStr = new char[128];
	sprintf(excStr, "Cannot generate code for branch instructions with C flag");
	exc = shared_ptr<IllegalInsn> 
	  (new IllegalInsn(excStr, excLine, excFile.c_str(), __LINE__, __FILE__));
	alo.logException(exc);
	delete excStr;
      }
  }

  bool
  M480GenRtlVisitor::checkBFFlag(shared_ptr<const LlirOperand> opnd) const
  {
    shared_ptr<std::exception> exc; 
      
    shared_ptr<const CbranchFlags> cbf =
      shared_dynamic_cast<const CbranchFlags> (opnd);

    if(cbf)
      {

	CbranchFlags::ConstIterator cbfIter = cbf->begin();
	
	for(; cbfIter != cbf->end(); cbfIter++)
	  {
	    shared_ptr<const BFFlag> bf_flag = shared_dynamic_cast<const BFFlag>(*cbfIter);
	    if(bf_flag)
	      {
		return true;
	      }
	  }
      }

