testhound/alo/alo/octave/m480/M480GenRtlVisitor.cpp
    return false;
  }

  bool 
  M480GenRtlVisitor::isSigned(const Alu3OpSxInstruction &i)
  {
    if(i.getSxFlag()->isNullOperand())
      {
	return true;
      }
    else
      {
	return false;
      }
  }

  void
  M480GenRtlVisitor::genOperandRtl(const MvhOpInstruction &i)
  {
    i.getSrc()->accept(*this);
    i.getDst()->accept(*this);
  }

  void
  M480GenRtlVisitor::genOperandRtl(const M480AddneInstruction &i)
  {
    i.getSrc1()->accept(*this);
    i.getSrc2()->accept(*this);
    i.getDst()->accept(*this);
  }

  void
  M480GenRtlVisitor::genOperandRtl(const M480AddneiInstruction &i)
  {
    i.getSrc1()->accept(*this);
    i.getSrc2()->accept(*this);
    i.getDst()->accept(*this);
  }

  void
  M480GenRtlVisitor::genOperandRtl(const Alu3OpSxInstruction &i)
  {
    i.getSrc1()->accept(*this);
    i.getSrc2()->accept(*this);
    i.getDst()->accept(*this);
  }

  void
  M480GenRtlVisitor::genOperandRtl(const Alu3OpAbcInstruction &i)
  {
    checkAbcFlag(getAlo(), i.getAbcFlag(), i.getSrcLineNum(), i.getSrcFile());
    i.getSrc1()->accept(*this);
    i.getSrc2()->accept(*this);
    i.getDst()->accept(*this);
  }

  void
  M480GenRtlVisitor::genOperandRtl(const Alu3OpAbcModInstruction &i)
  {
    checkAbcFlag(getAlo(), i.getAbcFlag(), i.getSrcLineNum(), i.getSrcFile());
    i.getSrc1()->accept(*this);
    i.getSrc2()->accept(*this);
    i.getDst()->accept(*this);
    i.getModFlag()->accept(*this);
  }

  void
  M480GenRtlVisitor::genOperandRtl(const Alu2OpBranchInstruction &i)
  {
    i.getSrc1()->accept(*this);
    i.getDst()->accept(*this);
    i.getBranchTarget()->accept(*this);
  }

  void
  M480GenRtlVisitor::genOperandRtl(const Alu2OpFindInstruction &i)
  {	
    i.getSrc1()->accept(*this);
    i.getDst()->accept(*this);
  }

  void
  M480GenRtlVisitor::genOperandRtl(const TestBitBranchInstruction &i)
  {
    i.getSrc1()->accept(*this);
    i.getBitpos()->accept(*this);
    i.getDisp()->accept(*this);
  }

  void
  M480GenRtlVisitor::genOperandRtl(const ZeroBranchImmedInstruction &i)
  {
    i.getSrc1()->accept(*this);
    i.getSrc2()->accept(*this);
    i.getCmpReg()->accept(*this);
  }

  void
  M480GenRtlVisitor::genOperandRtl(const ZeroBranchInstruction &i)
  {
    i.getSrc1()->accept(*this);
    i.getSrc2()->accept(*this);
    i.getCmpReg()->accept(*this);
  }

  void
  M480GenRtlVisitor::genOperandRtl(const CmovOpInstruction &i)
  {
    i.getSrc1()->accept(*this);
    i.getSrc2()->accept(*this);
    i.getDst()->accept(*this);
  }

  void
  M480GenRtlVisitor::genOperandRtl(const CompareOpSignInstruction &i)
  {
    i.getSrc1()->accept(*this);
    i.getSrc2()->accept(*this);
    i.getDst()->accept(*this);
  }

  void
  M480GenRtlVisitor::genOperandRtl(const CompareOpBranchInstruction &i)
  {
    i.getSrc1()->accept(*this);
    i.getSrc2()->accept(*this);
    i.getBranchTarget()->accept(*this);
    i.getAbcFlag()->accept(*this);
  }

  void
  M480GenRtlVisitor::genOperandRtl(const MultiRegLinkInstruction &i)
  {
    i.getRegs()->accept(*this);
    i.getMem()->accept(*this);
  }

  void
  M480GenRtlVisitor::genOperandRtl(const MultiRegLoadInstruction &i)
  {
    i.getRegs()->accept(*this);
    i.getMem()->accept(*this);
  }

  void
  M480GenRtlVisitor::genOperandRtl(const MultiRegStoreInstruction &i)
  {
    i.getRegs()->accept(*this);
    i.getMem()->accept(*this);
  }

  void
  M480GenRtlVisitor::genOperandRtl(const CondBranchImmedInstruction &i)
  {
    i.getSrc1()->accept(*this);
    i.getEss()->accept(*this);
    i.getDst()->accept(*this);
  }

  void
  M480GenRtlVisitor::genOperandRtl(const DmaOpInstruction &i)
  {
    i.getRegs()->getRegister(0)->accept(*this);
    i.getDmaFlags()->accept(*this);
  }

  void
  M480GenRtlVisitor::genOperandRtl(const BitOpInstruction &i)
  {
    i.getNumBits()->accept(*this);
    i.getSrcBitNum()->accept(*this);
    i.getSrc1()->accept(*this);
    i.getDstBitNum()->accept(*this);
    i.getDst()->accept(*this);
  }

  void
  M480GenRtlVisitor::genOperandRtl(const BitOpImmInstruction &i)
  {
    i.getNumBits()->accept(*this);    
    i.getSrc1()->accept(*this);       
    i.getDstBitNum()->accept(*this);  
    i.getDst()->accept(*this);        
  }

  void
  M480GenRtlVisitor::genOperandRtl(const LoadImmediateInstruction &i)
  {
    i.getDst()->accept(*this);
    i.getSrc()->accept(*this);
  }

  void
  M480GenRtlVisitor::genOperandRtl(const LoadHalfwordInstruction &i)
  {
    i.getDst()->accept(*this);
    i.getSrc()->accept(*this);
  }

  void
  M480GenRtlVisitor::genOperandRtl(const M480UnlinkInstruction &i)
  {
    unsigned int reg;

    unsigned int count = i.getRegs()->getNumRegs();

    for(reg=0; reg < count; reg++)
      {
	i.getRegs()->getRegister(reg)->accept(*this);
      }
  }

  void
  M480GenRtlVisitor::storeReturnReg(shared_ptr<const Register> reg, unsigned int line, const char* file)
  {
    shared_ptr<const Register> retReg = getCurrentFunction()->getReturnReg();

    shared_ptr<const NullRegister> nullReg = 
      shared_dynamic_cast<const NullRegister>(retReg);

    if(!nullReg)
      {
	if(retReg->getRegNum() != reg->getRegNum())
	  {
	    insnRaiseException("Multiple Return Registers used in the current function", line, file);
	    return;
	  }
      }

    getCurrentFunction()->storeReturnReg(reg);
  }


  void
  M480GenRtlVisitor::insnRaiseException(const char *error, unsigned int excLine, const string& excFile)
  {
    OctaveAlo& alo = getAlo();
    shared_ptr<std::exception> exc; 
	
    ostringstream excStr;
    excStr << error;
    exc = shared_ptr<IllegalInsn> 
      (new IllegalInsn(excStr.str().c_str(), excLine, excFile.c_str(), __LINE__, __FILE__));
    alo.logException(exc);
  }

  void
  M480GenRtlVisitor::insnRaiseWarning(const char *warning_str, unsigned int warningLine, const string& warningFile)
  {
    OctaveAlo& alo = getAlo();
    shared_ptr<std::exception> warnException; 
	
    ostringstream warningStr;
    warningStr << warning_str;
    warnException = shared_ptr<WarningDirectiveException> 
      (new WarningDirectiveException(warningStr.str().c_str(), warningLine, warningFile.c_str(), __LINE__, __FILE__));
    alo.logException(warnException);
  }

  void
  M480GenRtlVisitor::logSeqOperandException(unsigned int excLine, const string& excFile)
  {
    ostringstream excStr;
    shared_ptr<std::exception> exc;

    excStr << "Symbolic register is illegal for instructions in restricted or committed slot regions";
    exc = shared_ptr<IllegalInsn> 
      (new IllegalInsn(excStr.str().c_str(), excLine, excFile.c_str(), __LINE__, __FILE__));
    getAlo().logException(exc);
  }


  //////////////////////////////////////
  //
  // Asm RTL Generation
  //
  /////////////////////////////////////

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const Alu2OpBranchInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);

    genOperandRtl(i);

    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

    gcc_emit_alu2op_arith_asm_insn (i_stream.str().c_str(), 
				    lnk, 
				    mem,
				    i.getSrcFile().c_str(),
				    i.getSrcLineNum());
  }



  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const Alu2OpFindInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);

    genOperandRtl(i);

    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

    gcc_emit_alu2op_find_asm_insn (i_stream.str().c_str(), 
				   lnk, 
				   mem,
				   i.getSrcFile().c_str(),
				   i.getSrcLineNum());
  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const Alu3OpAbcInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);
    
    genOperandRtl(i);
    
    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

    gcc_emit_alu3op_abc_asm_insn (i_stream.str().c_str(), 
				  lnk, 
				  mem,
				  i.getSrcFile().c_str(),
				  i.getSrcLineNum()); 
  }
			
  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const Alu3OpAbcModInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);
   
    genOperandRtl(i);
    
    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

    gcc_emit_alu3op_abc_mod_asm_insn (i_stream.str().c_str(), 
				      lnk, 
				      mem,
				      i.getSrcFile().c_str(),
				      i.getSrcLineNum()); 
  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const Alu3OpSxInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);
    
    genOperandRtl(i);
    
    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

    gcc_emit_alu3op_sx_asm_insn (i_stream.str().c_str(), 
				 lnk, 
				 mem,
				 i.getSrcFile().c_str(),
				 i.getSrcLineNum()); 
  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const DmaOpInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);

    genOperandRtl(i);

    gcc_emit_dmaop_asm_insn (i_stream.str().c_str(),
			     i.getSrcFile().c_str(),
			     i.getSrcLineNum()); 
  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const BitOpInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);

    genOperandRtl(i);

    gcc_emit_bitop_asm_insn(i_stream.str().c_str(),
			    i.getSrcFile().c_str(),
			    i.getSrcLineNum()); 
  }


  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const BitOpImmInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);

    genOperandRtl(i);

