testhound/alo/alo/octave/m480/M480GenRtlVisitor.cpp
    gcc_emit_bitop_imm_asm_insn(i_stream.str().c_str(),
				i.getSrcFile().c_str(),
				i.getSrcLineNum()); 
  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const CompareOpBranchInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);

    genOperandRtl(i);

    gcc_emit_cmp_asm_insn(i_stream.str().c_str(),
			  i.getSrcFile().c_str(),
			  i.getSrcLineNum()); 
  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const CompareOpSignInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);

    genOperandRtl(i);

    gcc_emit_cmpr_asm_insn(i_stream.str().c_str(),
			   i.getSrcFile().c_str(),
			   i.getSrcLineNum()); 
  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const MultiRegLoadInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);

    genOperandRtl(i);

    shared_ptr<const LinkFlag> linkFlag = 
      shared_dynamic_cast<const LinkFlag>(i.getLinkFlag());

    //if no link flag is specified it implies to clear
    //existing links to registers
    LinkFlag::Link_Flag_t lnk = LinkFlag::CLEARLINK;
    
    if(linkFlag)
      {
	lnk = linkFlag->getLinkFlagType();
      }
    
    updateLinkInfo(i.getSrcLineNum(), i.getSrcFile().c_str(), OctaveMemory::MEMTYPE_ANY, lnk, i.getRegs());

    shared_ptr<const OctaveMemory> mem = i.getMem();

    shared_ptr<const RegPlusOffsetIndirect> regOffset =
      shared_dynamic_cast<const RegPlusOffsetIndirect>(mem);

    shared_ptr<const Base2PlusOffset> base2Offset =
      shared_dynamic_cast<const Base2PlusOffset>(mem);

    shared_ptr<const Base3PlusOffset> base3Offset =
      shared_dynamic_cast<const Base3PlusOffset>(mem);

    shared_ptr<const ImpliedBase2Offset> impOffset = 
      shared_dynamic_cast<const ImpliedBase2Offset>(mem);

    if (impOffset)
      {
	// This is a "plain" offset argument that will become a BASE2 in the backend assembler.
	// convert it to a Base2PlusOffset.  Similar hack used in M4?0SemanticVisitor.cpp .
	assert(!base2Offset);
	base2Offset = shared_ptr<Base2PlusOffset>  (new Base2PlusOffset(impOffset->getOffset()));
      }

    if(regOffset)
      {
	gcc_emit_load_reg_offset_asm_insn(lnk, 
					  i_stream.str().c_str(),
					  i.getSrcFile().c_str(),
					  i.getSrcLineNum());
      }
    else if(base2Offset)
      {
	gcc_emit_load_base2_offset_asm_insn(lnk, 
					    i_stream.str().c_str(),
					    i.getSrcFile().c_str(),
					    i.getSrcLineNum());
      }
    else if(base3Offset)
      {
	gcc_emit_load_base3_offset_asm_insn(lnk, 
					    i_stream.str().c_str(),
					    i.getSrcFile().c_str(),
					    i.getSrcLineNum());
      }
  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const MultiRegStoreInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);

    genOperandRtl(i);

    shared_ptr<const OctaveMemory> mem = i.getMem();

    shared_ptr<const RegPlusOffsetIndirect> regOffset =
      shared_dynamic_cast<const RegPlusOffsetIndirect>(mem);

    shared_ptr<const Base2PlusOffset> base2Offset =
      shared_dynamic_cast<const Base2PlusOffset>(mem);

    shared_ptr<const Base3PlusOffset> base3Offset =
      shared_dynamic_cast<const Base3PlusOffset>(mem);

    shared_ptr<const ImpliedBase2Offset> impOffset = 
      shared_dynamic_cast<const ImpliedBase2Offset>(mem);

    if (impOffset)
      {
	// This is a "plain" offset argument that will become a BASE2 in the backend assembler.
	// convert it to a Base2PlusOffset.  Similar hack used in M4?0SemanticVisitor.cpp .
	assert(!base2Offset);
	base2Offset = shared_ptr<Base2PlusOffset>  (new Base2PlusOffset(impOffset->getOffset()));
      }

    if(regOffset)
      {
	gcc_emit_store_reg_offset_asm_insn(i_stream.str().c_str(),
					   i.getSrcFile().c_str(),
					   i.getSrcLineNum());
      }
    else if(base2Offset)
      {
	gcc_emit_store_base2_offset_asm_insn(i_stream.str().c_str(),
					     i.getSrcFile().c_str(),
					     i.getSrcLineNum());
      }
    else if(base3Offset)
      {
	gcc_emit_store_base3_offset_asm_insn(i_stream.str().c_str(),
					     i.getSrcFile().c_str(),
					     i.getSrcLineNum());
      }
  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const MultiRegLinkInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);

    genOperandRtl(i);

    shared_ptr<const OctaveMemory> mem = i.getMem();

	
    shared_ptr<const LinkFlag> linkFlag = i.getLinkFlag();
    LinkFlag::Link_Flag_t lnk = linkFlag->getLinkFlagType();
    
    updateLinkInfo(i.getSrcLineNum(), i.getSrcFile().c_str(), OctaveMemory::MEMTYPE_ANY, lnk, i.getRegs());

    shared_ptr<const RegPlusOffsetIndirect> regOffset =
      shared_dynamic_cast<const RegPlusOffsetIndirect>(mem);
    
    shared_ptr<const Base2PlusOffset> base2Offset =
      shared_dynamic_cast<const Base2PlusOffset>(mem);

    shared_ptr<const Base3PlusOffset> base3Offset =
      shared_dynamic_cast<const Base3PlusOffset>(mem);

    if(regOffset)
      {
	gcc_emit_link_reg_offset_asm_insn(lnk,   
					  i_stream.str().c_str(),
					  i.getSrcFile().c_str(),
					  i.getSrcLineNum());
      }
    else if(base2Offset)
      {
	gcc_emit_link_base2_offset_asm_insn(lnk,   
					    i_stream.str().c_str(),
					    i.getSrcFile().c_str(),
					    i.getSrcLineNum());
      }
    else if(base3Offset)
      {
	gcc_emit_link_base3_offset_asm_insn(lnk,   
					    i_stream.str().c_str(),
					    i.getSrcFile().c_str(),
					    i.getSrcLineNum());
      }
  }


  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const LoadImmediateInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);
    
    genOperandRtl(i);
    
    gcc_emit_load_op_imm_asm_insn(i_stream.str().c_str(),
				  i.getSrcFile().c_str(),
				  i.getSrcLineNum());
  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const LoadHalfwordInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);
    
    genOperandRtl(i);
    
