testhound/alo/alo/octave/m480/M480GenRtlVisitor.cpp
    gcc_emit_load_op_hword_asm_insn(i_stream.str().c_str(),
				    i.getSrcFile().c_str(),
				    i.getSrcLineNum());
  }


  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const CmovOpInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);
    
    genOperandRtl(i);
    
    gcc_emit_cmov_asm_insn(i_stream.str().c_str(),
			   i.getSrcFile().c_str(),
			   i.getSrcLineNum());
  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const M480AddneInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);

    genOperandRtl(i);

    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

    gcc_emit_addne_asm_insn (i_stream.str().c_str(), 
			     lnk, 
			     mem,
			     i.getSrcFile().c_str(),
			     i.getSrcLineNum());
  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const M480AddneiInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);

    genOperandRtl(i);

    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

    gcc_emit_addnei_asm_insn (i_stream.str().c_str(), 
			      lnk, 
			      mem,
			      i.getSrcFile().c_str(),
			      i.getSrcLineNum());
  }
	
  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const M480JbrsInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);

    i.getDst()->accept(*this);  // rpc

    gcc_emit_jbrs_asm_insn (i_stream.str().c_str(), 
			    i.getSrcFile().c_str(),
			    i.getSrcLineNum()); 
  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const M480NopInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);

    gcc_emit_nop_asm_insn (i_stream.str().c_str(), 
			   i.getSrcFile().c_str(),
			   i.getSrcLineNum()); 
  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const M480ParInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);

    i.getSrc1()->accept(*this);
    i.getDst()->accept(*this);
	
    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());
	
    gcc_emit_par_asm_insn (i_stream.str().c_str(), 
			   lnk,
			   mem,
			   i.getSrcFile().c_str(),
			   i.getSrcLineNum()); 
  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const M480JbrslInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);

    gcc_emit_jbrsl_asm_insn (i_stream.str().c_str(), 
			     i.getSrcFile().c_str(),
			     i.getSrcLineNum()); 

  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const M480BrspreInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);

    gcc_emit_brspre_asm_insn (i_stream.str().c_str(), 
			      i.getSrcFile().c_str(),
			      i.getSrcLineNum()); 
  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const M480ByteswInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);
    
    i.getB3()->accept(*this);
    i.getB2()->accept(*this);
    i.getB1()->accept(*this);
    i.getB0()->accept(*this);
    i.getDst()->accept(*this);
    i.getSrc1()->accept(*this);

    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

    gcc_emit_bytesw_asm_insn (i_stream.str().c_str(), 
			      lnk,
			      mem,
			      i.getSrcFile().c_str(),
			      i.getSrcLineNum()); 
  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const M480JrnmiInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);

    gcc_emit_jrnmi_asm_insn (i_stream.str().c_str(), 
			     i.getSrcFile().c_str(),
			     i.getSrcLineNum()); 
  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const M480JrintInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);

    gcc_emit_jrint_asm_insn (i_stream.str().c_str(), 
			     i.getSrcFile().c_str(),
			     i.getSrcLineNum()); 
  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const M480MvInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);

    // Mv is really Ori rsa 0 rd. 
    // We simulate this by pushing const_int 0 on stack

    i.getSrc()->accept(*this);
    gcc_push_unsigned_immediate (0);
    i.getDst()->accept(*this);

    LinkFlag::Link_Flag_t lnk = getRegLink(i.getDst()->getRegNum());
    OctaveMemory::MemType_t mem = getRegisterLinkedMemoryType(i.getDst()->getRegNum());

    gcc_emit_alu3op_abc_asm_insn (i_stream.str().c_str(), 
				  lnk, 
				  mem,
				  i.getSrcFile().c_str(),
				  i.getSrcLineNum()); 
  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const M480PutmInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);

    i.getRsa()->accept(*this);
    i.getRsb()->accept(*this);

    gcc_emit_putm_asm_insn(i_stream.str().c_str(),
			   i.getSrcFile().c_str(),
			   i.getSrcLineNum());

  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const M480UnlinkInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);
    
    genOperandRtl(i);

    gcc_emit_unlink_asm_insn(i_stream.str().c_str(),
			     i.getSrcFile().c_str(),
			     i.getSrcLineNum());
  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const M480PutcInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);

    i.getRsa()->accept(*this);
    i.getRsb()->accept(*this);

    gcc_emit_putc_asm_insn(i_stream.str().c_str(),
			   i.getSrcFile().c_str(),
			   i.getSrcLineNum());

