testhound/alo/alo/octave/m480/M480GenRtlVisitor.cpp
  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const M480PutpInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);

    i.getRsa()->accept(*this);
    i.getRsb()->accept(*this);

    gcc_emit_putp_asm_insn(i_stream.str().c_str(),
			   i.getSrcFile().c_str(),
			   i.getSrcLineNum());

  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const M480PutdInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);

    i.getRsa()->accept(*this);
    i.getRsb()->accept(*this);

    // FIXME: Implement putd in GCC, fix this call.
    gcc_emit_putp_asm_insn(i_stream.str().c_str(),
			   i.getSrcFile().c_str(),
			   i.getSrcLineNum());

  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const M480GetInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);

    i.getRsa()->accept(*this);

    gcc_emit_get_asm_insn(i_stream.str().c_str(),
			  i.getSrcFile().c_str(),
			  i.getSrcLineNum());
  }


  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const M480MvrhInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);
    
    i.getSrc()->accept(*this);
    i.getDst()->accept(*this);
    
    gcc_emit_mvrh_asm_insn(i_stream.str().c_str(),
			   i.getSrcFile().c_str(),
			   i.getSrcLineNum());

  }

  void
  M480GenRtlVisitor::genAsmRtlForInstruction(const M480MvhrInstruction &i)
  {
    ostringstream i_stream;
    M480RtlPrintVisitor iv(i_stream);
    i.accept(iv);
    
    i.getSrc()->accept(*this);
    i.getDst()->accept(*this);
    
    gcc_emit_mvhr_asm_insn(i_stream.str().c_str(),
			   i.getSrcFile().c_str(),
			   i.getSrcLineNum());
  }


}

																											
